CREATE DATABASE  IF NOT EXISTS `ai_go` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `ai_go`;
-- MySQL dump 10.13  Distrib 8.0.43, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: ai_go
-- ------------------------------------------------------
-- Server version	8.0.43

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `category`
--

DROP TABLE IF EXISTS `category`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `category` (
  `category_id` varchar(36) NOT NULL COMMENT 'PK. 카테고리 고유번호',
  `category_name` varchar(100) NOT NULL,
  PRIMARY KEY (`category_id`),
  UNIQUE KEY `uq_category_name` (`category_name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='문항 카테고리';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `category`
--

LOCK TABLES `category` WRITE;
/*!40000 ALTER TABLE `category` DISABLE KEYS */;
/*!40000 ALTER TABLE `category` ENABLE KEYS */;
UNLOCK TABLES;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
/*!50003 CREATE*/ /*!50017 DEFINER=`root`@`localhost`*/ /*!50003 TRIGGER `bi_category_uuid` BEFORE INSERT ON `category` FOR EACH ROW BEGIN
  IF NEW.`category_id` IS NULL OR NEW.`category_id`='' THEN SET NEW.`category_id`=UUID(); END IF;
END */;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;

--
-- Table structure for table `history`
--

DROP TABLE IF EXISTS `history`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `history` (
  `history_id` varchar(36) NOT NULL COMMENT 'PK. 풀이 기록 고유번호',
  `user_id` varchar(36) NOT NULL COMMENT 'FK → users.user_id',
  `quiz_set_no` int DEFAULT NULL COMMENT '사용자가 푼 퀴즈 세트 (새로 풀 때마다 생성)',
  `quiz_set_date` datetime DEFAULT NULL COMMENT '세트를 푼 날짜',
  `quiz_id` varchar(36) DEFAULT NULL COMMENT 'FK → quiz.quiz_id',
  `is_correct` tinyint(1) DEFAULT NULL COMMENT '사용자가 퀴즈를 맞았는지 틀렸는지',
  `time_spent_sec` int unsigned DEFAULT NULL COMMENT '문제를 푼 시간(초)',
  PRIMARY KEY (`history_id`),
  KEY `user_id_idx` (`user_id`),
  KEY `quiz_id_idx` (`quiz_id`),
  CONSTRAINT `fk_hist_quiz` FOREIGN KEY (`quiz_id`) REFERENCES `quiz` (`quiz_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `fk_hist_user` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='사용자 기록';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `history`
--

LOCK TABLES `history` WRITE;
/*!40000 ALTER TABLE `history` DISABLE KEYS */;
INSERT INTO `history` VALUES ('05ee6481-7d8c-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20',1,'2025-08-18 16:00:10','191130_hard_0',0,42),('05ee6e1e-7d8c-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20',1,'2025-08-18 16:01:05','191130_hard_1',1,31),('05ee6fa4-7d8c-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20',1,'2025-08-18 16:02:00','191130_hard_2',1,28),('05ee70fa-7d8c-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20',1,'2025-08-18 16:02:40','87769_middle_0',1,34),('05ee719e-7d8c-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20',1,'2025-08-18 16:03:30','zigzag_basic_0',0,29),('08cc4acd-7d8c-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20',2,'2025-08-18 16:20:15','110353_middle_0',1,37),('08cc5248-7d8c-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20',2,'2025-08-18 16:21:10','110353_middle_2',0,50),('08cc57d0-7d8c-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20',2,'2025-08-18 16:22:05','110353_middle_3',0,45),('08cc5c07-7d8c-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20',2,'2025-08-18 16:22:50','191130_hard_0',1,33),('08cc5f5e-7d8c-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20',2,'2025-08-18 16:23:40','zigzag_basic_1',0,31),('781cf218-7c4d-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:05:05','87769_middle_0',0,33),('781cf2ec-7c4d-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:06:00','87769_middle_2',0,40),('781cf35d-7c4d-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:06:55','87769_middle_3',0,39),('781cf3d6-7c4d-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:07:40','110353_middle_0',0,28),('781cf430-7c4d-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:08:30','191130_hard_0',0,36),('781cf491-7c4d-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced',2,'2025-08-18 16:25:00','zigzag_basic_0',0,27),('781cf4f9-7c4d-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced',2,'2025-08-18 16:25:55','zigzag_basic_1',0,34),('781cf569-7c4d-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced',2,'2025-08-18 16:26:40','110353_middle_2',0,35),('781cf5d9-7c4d-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced',2,'2025-08-18 16:27:30','191130_hard_1',0,32),('781cf63b-7c4d-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced',2,'2025-08-18 16:28:20','87769_middle_1',0,26),('781cf6a1-7c4d-11f0-a0df-bcfce7e0bced','70599c30-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:10:10','110353_middle_0',0,41),('781cf711-7c4d-11f0-a0df-bcfce7e0bced','70599c30-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:11:05','191130_hard_1',0,26),('781cf776-7c4d-11f0-a0df-bcfce7e0bced','70599c30-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:12:00','zigzag_basic_1',0,24),('781cf7da-7c4d-11f0-a0df-bcfce7e0bced','70599c30-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:12:50','87769_middle_2',0,30),('781cf836-7c4d-11f0-a0df-bcfce7e0bced','70599c30-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:13:40','191130_hard_2',0,38),('781cf89a-7c4d-11f0-a0df-bcfce7e0bced','70599c86-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:12:20','110353_middle_2',0,32),('781cf90d-7c4d-11f0-a0df-bcfce7e0bced','70599c86-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:13:15','110353_middle_3',0,36),('781cf96d-7c4d-11f0-a0df-bcfce7e0bced','70599c86-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:14:05','191130_hard_0',0,38),('781cf9c5-7c4d-11f0-a0df-bcfce7e0bced','70599c86-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:14:55','87769_middle_0',0,27),('781cfa23-7c4d-11f0-a0df-bcfce7e0bced','70599c86-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:15:45','zigzag_basic_0',0,25),('781cfabf-7c4d-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:15:00','87769_middle_1',0,29),('781cfb1c-7c4d-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:15:50','87769_middle_2',0,43),('781cfb87-7c4d-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:16:40','87769_middle_3',0,35),('781cfbe6-7c4d-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:17:30','191130_hard_0',0,41),('781cfc4d-7c4d-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced',1,'2025-08-18 16:18:20','110353_middle_1',0,33),('781cfcba-7c4d-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced',2,'2025-08-18 16:30:00','zigzag_basic_0',0,22),('781cfd14-7c4d-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced',2,'2025-08-18 16:30:50','110353_middle_0',0,44),('781cfd74-7c4d-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced',2,'2025-08-18 16:31:40','110353_middle_2',0,39),('781cfdcf-7c4d-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced',2,'2025-08-18 16:32:30','191130_hard_2',0,28),('781cfe4d-7c4d-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced',2,'2025-08-18 16:33:20','zigzag_basic_1',0,24),('d2446162-7d8a-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20',1,'2025-08-18 16:00:10','191130_hard_0',0,42),('d24476a9-7d8a-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20',1,'2025-08-18 16:01:05','191130_hard_1',1,31),('d24478a9-7d8a-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20',1,'2025-08-18 16:02:00','191130_hard_2',1,28),('d2447a47-7d8a-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20',1,'2025-08-18 16:02:40','87769_middle_0',1,34),('d2447c30-7d8a-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20',1,'2025-08-18 16:03:30','zigzag_basic_0',0,29);
/*!40000 ALTER TABLE `history` ENABLE KEYS */;
UNLOCK TABLES;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
/*!50003 CREATE*/ /*!50017 DEFINER=`root`@`localhost`*/ /*!50003 TRIGGER `bi_history_uuid` BEFORE INSERT ON `history` FOR EACH ROW BEGIN
  IF NEW.`history_id` IS NULL OR NEW.`history_id`='' THEN SET NEW.`history_id`=UUID(); END IF;
END */;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
/*!50003 CREATE*/ /*!50017 DEFINER=`root`@`localhost`*/ /*!50003 TRIGGER `trg_histins_to_wrongnote_once` AFTER INSERT ON `history` FOR EACH ROW BEGIN
  IF NEW.is_correct = 0
     AND NEW.quiz_id IS NOT NULL THEN
    INSERT IGNORE INTO ai_go.wrong_note (user_id, wrong_quiz_id)
    VALUES (NEW.user_id, NEW.quiz_id);
  END IF;
END */;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
/*!50003 CREATE*/ /*!50017 DEFINER=`root`@`localhost`*/ /*!50003 TRIGGER `trg_histupd_to_wrongnote_once` AFTER UPDATE ON `history` FOR EACH ROW BEGIN

  IF NEW.is_correct = 0

     AND (OLD.is_correct IS NULL OR OLD.is_correct <> 0)

     AND NEW.quiz_id IS NOT NULL THEN

    INSERT IGNORE INTO wrong_note (user_id, wrong_quiz_id)

    VALUES (NEW.user_id, NEW.quiz_id);

  END IF;

END */;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;

--
-- Table structure for table `options`
--

DROP TABLE IF EXISTS `options`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `options` (
  `option_id` varchar(36) NOT NULL COMMENT 'PK. 선지 고유번호',
  `quiz_id` varchar(36) NOT NULL COMMENT 'FK → quiz.quiz_id',
  `label` tinyint unsigned NOT NULL COMMENT '선지 번호 (1,2,3,4)',
  `option_text` text COMMENT '선택지 내용',
  `explanation_text` text COMMENT '해설 내용',
  `is_answer` tinyint(1) NOT NULL DEFAULT '0' COMMENT '해당 선지가 정답인지 아닌지',
  PRIMARY KEY (`option_id`),
  UNIQUE KEY `uq_options_quiz_label` (`quiz_id`,`label`),
  KEY `quiz_id_idx` (`quiz_id`),
  CONSTRAINT `fk_options_quiz` FOREIGN KEY (`quiz_id`) REFERENCES `quiz` (`quiz_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `chk_options_label` CHECK ((`label` between 1 and 8))
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='퀴즈 :  선지 - 해설';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `options`
--

LOCK TABLES `options` WRITE;
/*!40000 ALTER TABLE `options` DISABLE KEYS */;
INSERT INTO `options` VALUES ('01c7845c-7c48-11f0-a0df-bcfce7e0bced','110353_middle_3',1,'어린이 보호구역','어린이 보호구역 : 속도 억제 및 시인성 확보 목적으로 적색 포장 사용',0),('0201f341-7c44-11f0-a0df-bcfce7e0bced','zigzag_basic_0',3,'교통 혼잡을 줄이기 위한 장치다.','서행 안전표지는 교통안전시설(노면표시) 설치·관리 업무편람”에 따르면 교통량 조절 목적은 아니며, 보행자 안전 중심입니다.',0),('05d4db93-7c44-11f0-a0df-bcfce7e0bced','zigzag_basic_0',4,'오토바이나 자전거만 해당되는 표시다.','도로교통법 제31조1항 : “모든 차 또는 노면전차의 운전자는 다음 각 호의 어느 하나에 해당하는 곳에서는 서행하여야 한다”에 따라 모든 차에 적용되는 표시입니다.',0),('06067ec4-7c40-11f0-a0df-bcfce7e0bced','87769_middle_2',2,'경적을 울려 상대방에게 양보를 요구한다.\n','경적은 제49조 제1항에 따라 “위험 방지를 위한 경우”에만 사용할 수 있으며 양보 강요 수단이 아닙니다.',0),('062906b5-7c48-11f0-a0df-bcfce7e0bced','110353_middle_3',2,'고속도로 진·출입로','고속도로 진·출입로 : 주행 안전을 위해 노란선, 흰색 차선만 있으며 적색 포장은 사용되지 않음',1),('06e2ec9f-7c42-11f0-a0df-bcfce7e0bced','191130_hard_0',1,'차량 신호가 녹색이므로 보행자보다 차량이 우선한다.','도로교통법 제27조 제1항은 신호와 관계없이 보행자가 횡단보도를 통행하고 있으면 모든 차는 정지해야 한다고 명시합니다. 녹색 신호라도 차량이 우선이 아닙니다.',0),('0aa3416d-7c48-11f0-a0df-bcfce7e0bced','110353_middle_3',3,'사고다발지역','사고다발지역 : 위험 경고 목적의 적색 포장 사용 가능',0),('0ef92221-7c48-11f0-a0df-bcfce7e0bced','110353_middle_3',4,'소방시설 주 · 정차구역','소방시설 주·정차구역 : 불법 주정차 방지를 위해 적색 포장 사용',0),('0fa7e687-7c3e-11f0-a0df-bcfce7e0bced','87769_middle_0',4,'차량 크기가 작은 차량이 무조건 양보해야 한다.\n','도로교통법은 차량의 크기만을 기준으로 양보 의무를 규정하지 않습니다.\r\n제20조는 단순히 교행 곤란 시 일방이 양보하도록 규정할 뿐이며, “무조건 소형차 양보” 조항은 없습니다.',0),('11e9a54e-8240-11f0-afd0-d843ae853d20','87785_middle_1',1,'모든 차는 지정된 차로의 오른쪽 차로로 통행할 수 있다.','도로교통법 제13조(차마의 통행)3항 “차마의 운전자는 도로(보도와 차도가 구분된 도로에서는 차도를 말한다)의 중앙(중앙선이 설치되어 있는 경우에는 그 중앙선을 말한다. 이하 같다) 우측 부분을 통행하여야 한다.”에 따르면 모든 차량은 차로의 오른쪽으로 통행 가능합니다.',0),('14cc5ad4-7c45-11f0-a0df-bcfce7e0bced','110353_middle_0',1,'공사 구역 접근 시, 차단된 2차로를 피하려고 1차로로 차선 변경','위반 아님. \r\n→ 차선 변경 자체는 가능하며, 안전거리와 주변 차량 상황을 고려해 진행했다면 불법이 아니다. 다만, 변경 과정에서 앞차·뒤차의 정상적인 통행에 장애를 주면 위반이 될 수 있음 \r\n→ 관련 근거 : 도로교통법 제 19조(안전거리 확보 등) ③ 모든 차의 운전자는 차의 진로를 변경하려는 경우에 그 변경하려는 방향으로 오고 있는 다른 차의 정상적인 통행에 장애를 줄 우려가 있을 때에는 진로를 변경하여서는 아니 된다.',0),('15141413-8240-11f0-afd0-d843ae853d20','87785_middle_1',2,'승용자동차가 앞지르기를 할 때에는 통행 기준에 지정된 차로의 바로 옆 오른쪽 차로로 통행해야한다.','제21조 제1항(도로교통법)에 따르면 “다른 차를 앞지르려면 앞차의 좌측으로 통행하여야 한다.” 도로교통법 시행규칙 별표9에 따르면 앞지르기를 할 때에는 통행 기준에 지정된 차로의 바로 옆 왼쪽 차로로 통행할 수 있기 때문에 2번이 정답입니다.',1),('17227cc2-821f-11f0-afd0-d843ae853d20','98453_basic_1',1,'회전교차로에 선진입해 회전하고 있는 차량이 통행 우선권을 가진다.','- 도로교통법 제25조의2(회전교차로 통행방법)\r\n    \r\n    “① 모든 차의 운전자는 회전교차로에서는 반시계방향으로 통행하여야 한다.\r\n    \r\n    ② 모든 차의 운전자는 회전교차로에 진입하려는 경우에는 서행하거나 일시정지하여야 하며, 이미 진행하고 있는 다른 차가 있는 때에는 그 차에 진로를 양보하여야 한다.\r\n    \r\n    ③ 제1항 및 제2항에 따라 회전교차로 통행을 위하여 손이나 방향지시기 또는 등화로써 신호를 하는 차가 있는 경우 그 뒤차의 운전자는 신호를 한 앞차의 진행을 방해하여서는 아니 된다.” 제2항에 따라 회전교차로에서는 회전차량이 통행 우선권을 가집니다.',1),('175dde83-8240-11f0-afd0-d843ae853d20','87785_middle_1',3,'편도 4차로 일반도로에서 승용자동차의 주행차로는 모든 차로이다.','도로교통법에 따르면 승용차와 중소형 승합차는 편도 4차로 일반도로에서 모든 차로를 통행할 수 있기 때문에 오답입니다.',0),('17a5c1af-821a-11f0-afd0-d843ae853d20','154060_basic_1',1,'교차로','도로교통법 제22조(앞지르기 금지의 시기 및 장소) 3항 “모든 차의 운전자는 다음 각 호의 어느 하나에 해당하는 곳에서는 다른 차를 앞지르지 못한다. - 교차로, 터널 안, 다리 위, 도로의 구부러진 곳, 비탈길의 고갯마루 부근 또는 가파른 비탈길의 내리막 등 시ㆍ도경찰청장이 도로에서의 위험을 방지하고 교통의 안전과 원활한 소통을 확보하기 위하여 필요하다고 인정하는 곳으로서 안전표지로 지정한 곳” 에 따라 교차로 내에서는 앞지르기가 금지되어 있습니다.',0),('184f9e8e-8240-11f0-afd0-d843ae853d20','87785_middle_1',4,'편도 4차로 고속도로에서 대형화물자동차의 주행차로는 오른쪽차로이다.','도로교통법 시행규칙 별표 9 “고속도로 편도3차로 이상 - 오른쪽 차로 : 대형 승합자동차, 화물자동차, 특수자동차, 법 제2조제18호나목에 따른 건설기계”에 따라 대형 화물자동차의 주행차로는 오른쪽 차로입니다.',0),('19aab253-7c45-11f0-a0df-bcfce7e0bced','110353_middle_0',2,'공사 구역을 통과하며, 공사구간과 약 1m 간격으로 주행','위반 아님.\r\n→ 공사구간 1m 간격 주행은 법적으로 위반이 아니다.\r\n→ 작업자가 울타리나 안전구역 안에 있다면 직접적인 접촉 위험이 없으므로 명백한 위반은 아님.\r\n→ 단, 안전운전 의무(제48조)는 계속 적용됨.',0),('1a9937bf-7c43-11f0-a0df-bcfce7e0bced','191130_hard_2',1,'차량 신호가 녹색이면 우선 통과한다.','도로교통법 제27조는 차량 신호와 무관하게 보행자 우선 원칙을 규정합니다.',0),('1b68035c-821f-11f0-afd0-d843ae853d20','98453_basic_1',2,'회전교차로에 진입하고자 하는 경우 원활한 교통을 위해 신속하게 진입하도록 한다.','- 도로교통법 제25조의2(회전교차로 통행방법)\r\n    \r\n    “① 모든 차의 운전자는 회전교차로에서는 반시계방향으로 통행하여야 한다.\r\n    \r\n    ② 모든 차의 운전자는 회전교차로에 진입하려는 경우에는 서행하거나 일시정지하여야 하며, 이미 진행하고 있는 다른 차가 있는 때에는 그 차에 진로를 양보하여야 한다.\r\n    \r\n    ③ 제1항 및 제2항에 따라 회전교차로 통행을 위하여 손이나 방향지시기 또는 등화로써 신호를 하는 차가 있는 경우 그 뒤차의 운전자는 신호를 한 앞차의 진행을 방해하여서는 아니 된다.” 제2항에 따라 회전교차로에 진입하려는 차는 ‘서행하거나 일시정지’ 해야 합니다. 회전 중인 차가 있는지 확인하고 안전하게 합류하기 위함이므로, 신속히 진입하는 것은 매우 위험한 행동입니다.',0),('1bda31d6-821a-11f0-afd0-d843ae853d20','154060_basic_1',2,'중앙선(황색 점선)','도로교통법 제22조(앞지르기 금지의 시기 및 장소) 3항에 따라 앞지르기가 금지된 시기 및 장소에 중앙선이 명시되어 있지 않기 때문에 앞지르기가 가능합니다.',1),('1d9e40ff-8227-11f0-afd0-d843ae853d20','192029_hard_3',1,'회전교차로 진입 전 좌회전하려는 차량','도로교통법 제25조의2(회전교차로 통행방법)에 따르면 회전차량의 통행이 우선이며, 회전교차로 설계지침(2014.12) 1.3.1 회전교차로 정의에 따르면 회전차량은 회전차로를 주행하는 차량이고, 진입차량은 회전교차로 진입 전 좌회전, 직진, 우회전하려는 차량을 말합니다. 해당 선지는 진입차량을 뜻하므로 통행 우선권이 보장된 회전차량이 아닙니다.',0),('1dce4893-7c45-11f0-a0df-bcfce7e0bced','110353_middle_0',3,'횡단보도에 진입할 때, 보행자가 없음을 확인하고 그대로 주행 ','위반 아님.\r\n→ 보행자가 없고 횡단보도 신호가 적색이라면 차량이 정지할 의무는 없다.\r\n→ 단, 횡단보도 진입 시 전방 주시와 서행 의무는 항상 적용됨.\r\n',0),('1f71e1ed-8227-11f0-afd0-d843ae853d20','192029_hard_3',2,'회전교차로 진입 전 우회전하려는 차량','도로교통법 제25조의2(회전교차로 통행방법)에 따르면 회전차량의 통행이 우선이며, 회전교차로 설계지침(2014.12) 1.3.1 회전교차로 정의에 따르면 회전차량은 회전차로를 주행하는 차량이고, 진입차량은 회전교차로 진입 전 좌회전, 직진, 우회전하려는 차량을 말합니다. 해당 선지는 진입차량을 뜻하므로 통행 우선권이 보장된 회전차량이 아닙니다.',0),('1fd8dfca-821a-11f0-afd0-d843ae853d20','154060_basic_1',3,'터널 안(흰색 점선 차로)','도로교통법 제22조(앞지르기 금지의 시기 및 장소) 3항 “모든 차의 운전자는 다음 각 호의 어느 하나에 해당하는 곳에서는 다른 차를 앞지르지 못한다. - 교차로, 터널 안, 다리 위, 도로의 구부러진 곳, 비탈길의 고갯마루 부근 또는 가파른 비탈길의 내리막 등 시ㆍ도경찰청장이 도로에서의 위험을 방지하고 교통의 안전과 원활한 소통을 확보하기 위하여 필요하다고 인정하는 곳으로서 안전표지로 지정한 곳” 에 따라 터널 안에서는 앞지르기가 금지되어 있습니다.',0),('21c028cf-821f-11f0-afd0-d843ae853d20','98453_basic_1',3,'회전교차로는 시계방향으로 주행한다.','- 도로교통법 제25조의2(회전교차로 통행방법)\r\n    \r\n    “① 모든 차의 운전자는 회전교차로에서는 반시계방향으로 통행하여야 한다.\r\n    \r\n    ② 모든 차의 운전자는 회전교차로에 진입하려는 경우에는 서행하거나 일시정지하여야 하며, 이미 진행하고 있는 다른 차가 있는 때에는 그 차에 진로를 양보하여야 한다.\r\n    \r\n    ③ 제1항 및 제2항에 따라 회전교차로 통행을 위하여 손이나 방향지시기 또는 등화로써 신호를 하는 차가 있는 경우 그 뒤차의 운전자는 신호를 한 앞차의 진행을 방해하여서는 아니 된다.” 제1항에 따라 회전교차로에서는 반드시 반시계방향으로 주행해야 합니다.',0),('21cf3d9f-8227-11f0-afd0-d843ae853d20','192029_hard_3',3,'회전교차로 내 회전차로에서 주행 중인 차량','도로교통법 제25조의2(회전교차로 통행방법)에 따르면 회전차량의 통행이 우선이며, 회전교차로 설계지침(2014.12) 1.3.1 회전교차로 정의에 따르면 회전차량은 회전차로를 주행하는 차량이고, 진입차량은 회전교차로 진입 전 좌회전, 직진, 우회전하려는 차량을 말합니다. 해당 선지는 회전차량을 뜻하므로 통행 우선권이 보장됩니다.',1),('22048c64-7c43-11f0-a0df-bcfce7e0bced','191130_hard_2',2,'보행자가 천천히 걷는 경우 경적을 울려 빨리 가라고 한다.','경적 사용은 도로교통법 제49조에 따라 제한됩니다.',0),('22586ba8-821a-11f0-afd0-d843ae853d20','154060_basic_1',4,'다리 위(흰색 점선 차로)','도로교통법 제22조(앞지르기 금지의 시기 및 장소) 3항 “모든 차의 운전자는 다음 각 호의 어느 하나에 해당하는 곳에서는 다른 차를 앞지르지 못한다. - 교차로, 터널 안, 다리 위, 도로의 구부러진 곳, 비탈길의 고갯마루 부근 또는 가파른 비탈길의 내리막 등 시ㆍ도경찰청장이 도로에서의 위험을 방지하고 교통의 안전과 원활한 소통을 확보하기 위하여 필요하다고 인정하는 곳으로서 안전표지로 지정한 곳” 에 따라 다리 위에서는 앞지르기가 금지되어 있습니다.',0),('22c21f9b-8227-11f0-afd0-d843ae853d20','192029_hard_3',4,'회전교차로 진입 전 좌회전 및 우회전하려는 차량','도로교통법 제25조의2(회전교차로 통행방법)에 따르면 회전차량의 통행이 우선이며, 회전교차로 설계지침(2014.12) 1.3.1 회전교차로 정의에 따르면 회전차량은 회전차로를 주행하는 차량이고, 진입차량은 회전교차로 진입 전 좌회전, 직진, 우회전하려는 차량을 말합니다. 해당 선지는 진입차량을 뜻하므로 통행 우선권이 보장된 회전차량이 아닙니다.',0),('24a72bfe-7c45-11f0-a0df-bcfce7e0bced','110353_middle_0',4,'전방 직진 신호가 녹색이므로, 시속 50km/h로 교차로를 통과','위반 맞음.\r\n→ 어린이 보호구역에서는 반드시 시속 30km/h 이내로 통행해야 한다.\r\n→ 따라서 직진 신호가 녹색이더라도 50km/h로 교차로를 통과하는 것은 명백한 제한속도 위반이다.\r\n→ 관련 근거 : 도로교통법 제12조(어린이 보호구역의 지정ㆍ해제 및 관리) ① 시장등은 교통사고의 위험으로부터 어린이를 보호하기 위하여 필요하다고 인정하는 경우에는 다음 각 호의 어느 하나에 해당하는 시설이나 장소의 주변도로 가운데 일정 구간을 어린이 보호구역으로 지정하여 자동차등과 노면전차의 통행속도를 시속 30킬로미터 이내로 제한할 수 있다.',1),('24b51b86-822a-11f0-afd0-d843ae853d20','131062_hard_0',1,'교차로의 신호가 적색 점멸 신호(깜빡이는 빨간불)이므로 반드시 정지한 후, 신호가 녹색으로 바뀐 후에 직진한다.','도로교통법 시행규칙 별표2 – 적색 등화의 점멸 : “차마는 정지선이나 횡단보도가 있을 때에는 그 직전이나 교차로의 직전에 일시정지한 후 다른 교통에 주의하면서 진행할 수 있다.”\r\nA번은 적색 점멸 신호에서 반드시 정지하고, 신호가 녹색이 될 때까지 대기해야 한다고 설명하지만, 도로교통법 시행규칙에 따르면 적색 등화의 점멸 상황에서는 일시정지 후 주변을 살피면서 주행 가능하다고 명시되어 있으므로 오답입니다.',0),('24e9cc49-821f-11f0-afd0-d843ae853d20','98453_basic_1',4,'회전교차로 진입 시 비상점멸등을  켜고 진입을 알린다.','도로교통법 시행령 [별표 2]에 따르면, 회전교차로 진입 시에는 좌측 방향지시등을, 진출(나갈 때)에는 우측 방향지시등을 켜야 합니다. 비상점멸등은 긴급상황을 알리는 등화이므로 일반적인 진입 신호로 사용하는 것은 옳지 않습니다.',0),('26fdce48-822a-11f0-afd0-d843ae853d20','131062_hard_0',2,'교차로의 신호가 적색 점멸 신호(깜빡이는 빨간불)이므로 일단 일시 정지한 후, 주변을 살핀 후 직진한다.','도로교통법 시행규칙 별표2 – 적색 등화의 점멸 : “차마는 정지선이나 횡단보도가 있을 때에는 그 직전이나 교차로의 직전에 일시정지한 후 다른 교통에 주의하면서 진행할 수 있다.”\r\nB번은 도로교통법 시행규칙 별표2의 내용인 적색 등화의 점멸 - “차마는 정지선이나 횡단보도가 있을 때에는 그 직전이나 교차로의 직전에 일시정지한 후 다른 교통에 주의하면서 진행할 수 있다.” 에 부합하기 때문에 정답입니다.',1),('27482cb2-7c43-11f0-a0df-bcfce7e0bced','191130_hard_2',3,'보행자가 횡단 중이면 차량은 반드시 정지해야 한다.','도로교통법 제27조 제1항에 따라 횡단보도 보행자 통행 중이면 차량은 일시정지해야 합니다.',1),('298241ce-822a-11f0-afd0-d843ae853d20','131062_hard_0',3,'교차로의 신호가 적색 점멸 신호(깜빡이는 빨간불)이므로 다른 차량을 방해하지 않도록 정지하지 말고 천천히 직진한다.','도로교통법 시행규칙 별표2 – 적색 등화의 점멸 : “차마는 정지선이나 횡단보도가 있을 때에는 그 직전이나 교차로의 직전에 일시정지한 후 다른 교통에 주의하면서 진행할 수 있다.”\r\n도로교통법 시행규칙 별표2에 따르면 적색 등화의 점멸 시 반드시 일시정지한 후에 차량을 진행해야 하므로 C번은 오답입니다.',0),('2a85b5f1-822a-11f0-afd0-d843ae853d20','131062_hard_0',4,'적색 점멸 신호(깜빡이는 빨간불)는 주의하라는 의미이므로 주변 교통 상황만 완벽하게 파악했다면 기존 속도로 교차로를 지나간다.','도로교통법 시행규칙 별표2 – 적색 등화의 점멸 : “차마는 정지선이나 횡단보도가 있을 때에는 그 직전이나 교차로의 직전에 일시정지한 후 다른 교통에 주의하면서 진행할 수 있다.”\r\n도로교통법 시행규칙 별표2에 따르면 적색 등화의 점멸 시 반드시 일시정지한 후에 차량을 진행해야 함을 명시하고 있는데, D번은 일시정지의 내용이 빠져있으므로 오답입니다.',0),('2d1aa86b-7c43-11f0-a0df-bcfce7e0bced','191130_hard_2',4,'보행자가 없는 쪽 차로만 비어 있으면 진행할 수 있다.','횡단보도 전체가 보행자 통행 공간이므로 일부 차로만 비었다고 통과할 수 없습니다.',0),('2edfcff2-7c42-11f0-a0df-bcfce7e0bced','191130_hard_0',2,'만약 보행자가 횡단보도를 통행하려고 하는 상황(통행 직전의 상황)이면 운전자는 그냥 차량 신호에 맞춰 주행할 수 있다.','도로교통법 제27조는 보행자가 “통행하려고 하는 때”도 보호 대상으로 포함하고 있습니다.',0),('3bfd2423-7c40-11f0-a0df-bcfce7e0bced','87769_middle_2',3,'일단 정지하여 상대 차량의 움직임을 확인한다.\n','제20조에 따라 일시정지하여 상대 차량과 협력하는 것이 원칙입니다.',1),('3f593ed2-8216-11f0-afd0-d843ae853d20','left_green_right_red_basic_1',1,'우측 도로의 횡단보도를 횡단하는 보행자','교차로에서 좌회전할 때에는 마주보는 도로에서 우회전하는 차량을 가장 주의해야 합니다. 따라서 우측 도로의 보행자가 가장 위험한 요인이 아닙니다.',0),('4214fe46-8226-11f0-afd0-d843ae853d20','192029_hard_0',1,'운전자 차량은 노란색 택시의 회전교차로 진입을 위해 서행하거나 필요 시에는 정지해야 한다.','도로교통법 제25조의2(회전교차로 통행방법) “모든 차의 운전자는 회전교차로에 진입하려는 경우에는 서행하거나 일시정지하여야 하며, 이미 진행하고 있는 다른 차가 있는 때에는 그 차에 진로를 양보하여야 한다.”에 따라 노란색 택시가 운전자 차량의 주행을 위해 서행하거나 일시정지 해야하므로 오답입니다.',0),('42642233-7c42-11f0-a0df-bcfce7e0bced','191130_hard_0',3,'횡단보도에서 보행자가 통행 중이면 운전자는 반드시 일시정지해야 한다.','도로교통법 제27조 제1항: “모든 차 또는 노면전차의 운전자는 보행자(제13조의2제6항에 따라 자전거등에서 내려서 자전거등을 끌거나 들고 통행하는 자전거등의 운전자를 포함한다)가 횡단보도를 통행하고 있거나 통행하려고 하는 때에는 보행자의 횡단을 방해하거나 위험을 주지 아니하도록 그 횡단보도 앞(정지선이 설치되어 있는 곳에서는 그 정지선을 말한다)에서 일시정지하여야 한다.” ',1),('439b843a-8216-11f0-afd0-d843ae853d20','left_green_right_red_basic_1',2,'우측 차로 후방에서 달려오는 오토바이','교차로에서 좌회전할 때에는 마주보는 도로에서 우회전하는 차량을 가장 주의해야 합니다. 따라서 차량의 우측 후방에서 달려오는 오토바이가 가장 위험한 요인이 아닙니다.',0),('459a50bf-8226-11f0-afd0-d843ae853d20','192029_hard_0',2,'노란색 택시는 회전교차로에 진입할 때 우측 방향지시등을 켜고 진입해야 한다.','도로교통법 제25조의2(회전교차로 통행방법) 에 따르면 모든 차는 반시계방향으로 통행하며, 제38조(차의 신호)와 한국교통안전공단에서는 회전교차로에 진입할 때 좌측 방향지시등을 점등해야 한다고 명시하고 있습니다.',0),('480d8284-8226-11f0-afd0-d843ae853d20','192029_hard_0',3,'노란색 택시는 회전교차로에 진입할 때 좌측 방향지시등을 켜고 진입해야 한다.','도로교통법 제 25조의2, 제38조(차의 신호), 한국교통안전공단에 따르면 회전교차로에 진입할 때 좌측 방향지시등을 점등해야 하므로 정답입니다.',1),('497eb520-8226-11f0-afd0-d843ae853d20','192029_hard_0',4,'회전교차로를 통행할 때, 교차로를 진입하려는 차량이 이미 교차로 내를 주행 중인 차량보다 우선이기 때문에 해당 영상에서는 운전자 차량의 과실이 크다.','도로교통법 제25조의2(회전교차로 통행방법) “회전교차로에 진입하려는 경우, 이미 진행하고 있는 다른 차가 있는 때에는 그 차에 진로를 양보하여야 한다.”에 따라 이미 회전하고 있는 차량이 우선이므로 해당 영상에서는 노란색 택시의 사고과실이 큽니다.',0),('49c22585-8216-11f0-afd0-d843ae853d20','left_green_right_red_basic_1',3,'좌측도로에서 우회전하는 승용차','교차로에서 좌회전할 때에는 마주보는 도로에서 우회전하는 차량을 가장 주의해야 합니다. 따라서 차량의 좌측도로에서 우회전하는 스용차가 가장 위험한 요인이 아닙니다.',0),('4ccaedf0-7c40-11f0-a0df-bcfce7e0bced','87769_middle_2',4,'중앙선을 넘어 상대 차량을 피해간다.\n','제13조에 따른 우측 통행 의무를 위반하는 행위입니다.\n',0),('4cda2b09-8216-11f0-afd0-d843ae853d20','left_green_right_red_basic_1',4,'반대편 도로에서 우회전하는 승용차','교차로에서 좌회전할 때에는 마주보는 도로 즉 반대편 도로에서 우회전하는 차량을 주의해야 하므로 D가 정답입니다.',1),('54cfad86-8229-11f0-afd0-d843ae853d20','149112_hard_0',1,'검은색 세단이 다른 차와 충돌해도 책임이 있다.','도로교통법 제25조 제3항: “검은색 세단이 다른 차와 충돌해도 책임이 있다.”\r\n이 조항은 검은색 세단이 사고를 일으켰을 때 책임이 있다는 것을 말하는 것이지, 자동적으로 책임이 부과된다는 의미는 아니다. \r\n우회전 차량이 충돌을 일으킨 경우는 검은색 세단이 과실이 아니므로 이 조항만으로 책임을 결정할 수 없다.',0),('5730b04a-8229-11f0-afd0-d843ae853d20','149112_hard_0',2,'우회전 중인 차량이 검은색 세단이 진입한 차선과 교차하는 경로를 진행하면, 도로교통법 제25조 제4항에 따라 충돌 방지 책임을 진다.','도로교통법 제25조 제4항: “우회전 중인 차는 우회전하는 차량이 검은색 세단이 진입한 차선과 교차하는 경로를 진행하면, 그 차와 교차하는 경우 충돌 방지 책임을 진다.”\r\n이 조항이 바로 우리 상황에 해당한다. 우회전 중인 차량이 검은색 세단이 진입한 차선과 교차하는 경로를 통해 진행할 경우, 그 차량은 충돌 방지 책임을 지게 된다. 따라서 이 설명이 가장 정확하다.',1),('59529767-8229-11f0-afd0-d843ae853d20','149112_hard_0',3,'검은색 세단이 교차로에 진입한 경우, 우회전 차량은 선행권이 없으므로 검은색 세단을 피해야 한다.','도로교통법 제25조 제4항(및 제3항)\r\n제4항은 “진입한 차선과 교차하는 경로를 진행하면 충돌 방지 책임을 진다”고 명시하고 있으므로, ‘진행할 수 있다’는 설명은 법에 위배된다.',0),('5a33973d-8229-11f0-afd0-d843ae853d20','149112_hard_0',4,'우회전 중인 차량은 교차로에서 우선권이 없으므로 검은색 세단과 충돌해도 책임이 없다.','도로교통법 제25조 제1항: “교통사고가 발생한 경우 도로를 통행 중인 자전거등의 운전자는 검은색 세단이 진입한 차선과 충돌해도 책임이 있다.”\r\n이 조항은 자전거·등(예: 자전거, 오토바이 등) 운전자의 책임을 규정한 것이며, 우회전 차량의 우선권 여부와는 무관하다. 우회전 중인 차량이 충돌 방지 책임을 지지 않는다고 해석하는 것은 법과 맞지 않는다.',0),('5e78dd4a-7c42-11f0-a0df-bcfce7e0bced','191130_hard_0',4,'차량이 우회전 중일 경우, 보행자 보호 의무는 면제된다.','우회전 중이라도 보행자 보호 의무는 면제되지 않습니다. 제27조는 교차로의 좌·우회전 여부와 무관하게 적용됩니다.',0),('6396695c-7c44-11f0-a0df-bcfce7e0bced','zigzag_basic_1',1,'노면표시는 도로관리자가 임의로 설치하는 안내선일 뿐, 법적 구속력은 없다.','도로교통법 제12조 및 제13조, 제31조 등에 따라 노면표시는 법적 효력을 가지며 단순 안내가 아닙니다.',0),('63ca0890-8240-11f0-afd0-d843ae853d20','87785_middle_2',1,'차로의 순위는 도로의 중앙선 쪽에 있는 차로부터 1차로로 한다.','도로교통법 시행규칙 제16조(차로에 따른 통행구분)3항 “차로의 순위는 도로의 중앙선 쪽에 있는 차로부터 1차로로 한다. 다만, 일방통행도로에서는 도로의 왼쪽부터 1차로로 한다.” 에 따르면 중앙선에 가장 가까이 있는 차로부터 1차로입니다.',0),('646a79d4-8224-11f0-afd0-d843ae853d20','87768_middle_0',1,'전방 정체가 있으면 정지해야 한다.','제31조는 전방 정체가 일반 도로에서 발생했을 때 정지할 의무를 규정하지 않는다.',0),('6627439a-8240-11f0-afd0-d843ae853d20','87785_middle_2',2,'느린 속도로 진행하여 다른 차의 정상적인 통행을 방해할 우려가 있는 때에는 그 통행하던 차로의 오른쪽 차로로 통행하여야 한다.','도로교통법 제20조(진로 양보의 의무)1항 “모든 차(긴급자동차는 제외한다)의 운전자는 뒤에서 따라오는 차보다 느린 속도로 가려는 경우에는 도로의 우측 가장자리로 피하여 진로를 양보하여야 한다. 다만, 통행 구분이 설치된 도로의 경우에는 그러하지 아니하다.” 에 따르면 느린 속도로 진행해 다른 차량의 통행을 방해할 우려가 있다면 도로의 우측으로 피해야 한다고 명시되어 있습니다.',0),('666b370a-8224-11f0-afd0-d843ae853d20','87768_middle_0',2,'전방 정체가 있을 때 서행만 하면 된다.','제31조는 서행·정지의 의무가 특정 장소에 한정되며, 일반 도로에서는 서행만이 필수라는 규정이 없다.',0),('6872c3e5-821e-11f0-afd0-d843ae853d20','98453_basic_0',1,'반시계방향으로 운전하며, 진입 전에 서행하여 다른 차에 진로를 양보한다.','- 도로교통법 제25조의2 제1항:\r\n “모든 차의 운전자는 회전교차로에서는 반시계방향으로 통행하여야 한다.”\r\n회전교차로를 반시계방향으로 통행해야한다.\r\n\r\n- 도로교통법 제25조의2 제2항:\r\n“모든 차의 운전자는 회전교차로에 진입하려는 경우에는 서행하거나 일시정지하여야 하며, 이미 진행하고 있는 다른 차가 있는 때에는 그 차에 진로를 양보하여야 한다.”\r\n 진입 전 서행(또는 일시정지)하고, 다른 차량이 이미 진행 중이면 양보해야 한다.\r\n\r\n- 도로교통법 제38조 제1항:\r\n“회전교차로에 진입하거나 회전교차로에서 진출하는 경우에는 손이나 방향지시기 또는 등화로써 그 행위가 끝날 때까지 신호를 하여야 한다.”\r\n진입 시 방향지시를 해야 한다.\r\n따라서 A가 모든 법령을 충족하는 가장 적절한 행동이다.',1),('68e5e097-8220-11f0-afd0-d843ae853d20','110371_basic_0',1,'전차의 좌측으로 통행한다.','제21조(앞지르기 방법 등) ① **모든 차의 운전자는 다른 차를 앞지르려면 앞차의 좌측으로 통행하여야 한다.**\r\n\r\n전방의 화물차를 회피(앞지르기)할 때는 앞차의 좌측을 통과하는 것이 법에서 명시한 올바른 방법이다. 따라서 A가 정답이다.',1),('6983d942-7c44-11f0-a0df-bcfce7e0bced','zigzag_basic_1',2,'노면표시는 신호등보다 우선 적용되므로, 신호등과 다를 경우 노면표시에 따라야 한다.','도로교통법 제5조(신호 준수)에 따르면 신호등이 노면표시와 다를 경우 **신호등이 우선**입니다.',0),('6b62dbe5-8240-11f0-afd0-d843ae853d20','87785_middle_2',3,'일방통행 도로에서는 도로의 오른쪽부터 1차로 한다.','도로교통법 시행규칙 제16조(차로에 따른 통행구분)3항 “차로의 순위는 도로의 중앙선 쪽에 있는 차로부터 1차로로 한다. 다만, 일방통행도로에서는 도로의 왼쪽부터 1차로로 한다.” 에 따르면 중앙선에 가장 가까이 있는 왼쪽 차로부터 1차로가 됩니다.',1),('6c1bbb04-7c47-11f0-a0df-bcfce7e0bced','110353_middle_2',1,'차량 신호등이 녹색일지라도 도로를 횡단하는 어린이가 있는지 주의하며 서행한다.','위반 아님.\r\n→ 차량 신호가 녹색이라도 보호구역 내 어린이가 횡단할 수 있으므로 서행과 주의가 필요.',1),('6cb56796-821e-11f0-afd0-d843ae853d20','98453_basic_0',2,'직진 방향으로 진행하며, 다른 차에 양보하지 않아도 된다.','도로교통법 제25조의2 제2항에 따라 “이미 진행하고 있는 다른 차가 있는 때에는 그 차에 진로를 양보하여야 한다.”\r\n→ 직진 방향으로 진행해도 다른 차가 있으면 양보해야 하므로 B는 옳지 않다.',0),('6d9b89d9-8220-11f0-afd0-d843ae853d20','110371_basic_0',2,'전차의 우측으로 통행한다.','제21조 ② **자전거등의 운전자는 서행하거나 정지한 다른 차를 앞지르려면 제1항에도 불구하고 앞차의 우측으로 통행할 수 있다.**\r\n\r\n이는 자전거 운전자를 위한 예외이며, 일반 차량(자동차·화물차 등)에는 적용되지 않는다. 따라서 차량이 화물차 앞지르려 할 때는 좌측 통행이 요구되므로 B는 오답이다.',0),('6e7e47f7-8240-11f0-afd0-d843ae853d20','87785_middle_2',4,'편도 2차로 고속도로에서 모든 자동차는 2차로로 통행하는 것이 원칙이다.','도로교통법 시행규칙 별표 9 “고속도로 편도 2차로 - 2차로에서 통행할 수 있는 차종 : 모든 자동차”에 따라 편도 2차로 고속도로에서는 모든 자동차가 2차로로 통행 가능합니다.',0),('6ef7e502-8224-11f0-afd0-d843ae853d20','87768_middle_0',3,'전방 정체가 있을 때 차선 변경을 해야 한다.','차선 변경은 제31조에 규정되지 않으며, 정지·서행과는 무관하다.',0),('6fe4111f-8224-11f0-afd0-d843ae853d20','87768_middle_0',4,'전방 정체가 있을 때 정지해도 된다.','- 도로교통법 제31조 – “서행 또는 일시정지할 장소”\r\n모든 차 또는 노면전차의 운전자는 다음 각 호의 어느 하나에 해당하는 곳에서는 서행하여야 한다.\r\n\r\n1. 교차로 등\r\n2. 교통지시등이 있는 곳\r\n3. …일시정지할 곳\r\n\r\n모든 차 또는 노면전차의 운전자는 다음 각 호의 어느 하나에 해당하는 곳에서는 일시정지하여야 한다.\r\n\r\n1. 교차로 등\r\n2. 교통지시등이 있는 곳\r\n3. …\r\n\r\n이 조문은 **특정 장소(교차로, 교통지시등이 있는 곳 등)에서만 서행·일시정지가 요구**되는 것을 명시하고 있다.\r\n\r\n일반 도로에서 발생한 전방 정체(예: 차량 밀집, 교통 체증)는 이 조문에 규정된 “특정 장소”에 해당하지 않으므로, 법적으로 **정지를 해야 할 강제적 근거가 존재하지 않는다**.\r\n\r\n따라서 **정지해도(즉, 정지해도 된다)** 라는 선택지가 도로교통법의 요구사항과 가장 부합한다.\r\n\r\n(정지를 선택해도 법적으로 금지된 것은 아니며, 상황에 따라 필요하면 정지할 수 있다.)',1),('70fca314-7c47-11f0-a0df-bcfce7e0bced','110353_middle_2',2,'어린이의 하차를 위해서라면 잠시 정차할 수 있다.','위반 맞음.\r\n→ 어린이 보호구역 내에서는 주·정차 금지.\r\n→ 하차 목적이라도 예외적으로 지정된 승하차 구역이 아니면 위법\r\n→ 관련 근거 : 도로교통법 제32조 제8호\r\n',0),('7108f6fe-8220-11f0-afd0-d843ae853d20','110371_basic_0',3,'전차를 따라 같은 차로를 유지한다.','제20조(진로를 양보하는 방법 등) ① **모든 차의 운전자는 뒤에서 따라오는 차보다 느린 속도로 가려는 경우에는 도로의 우측 가장자리로 피하여 진로를 양보하여야 한다.**\r\n\r\n이 조항은 뒤따라오는 차량이 느린 경우 우측으로 양보해야 한다는 내용이며, 앞선 화물차를 회피하기 위해 같은 차로를 유지하는 행위와는 무관하다. 따라서 C는 오답이다.',0),('713fb80a-821e-11f0-afd0-d843ae853d20','98453_basic_0',3,'회전교차로에 진입할 때 신호를 하지 않아도 된다.','도로교통법 제38조 제1항에 따라 “회전교차로에 진입하거나 회전교차로에서 진출하는 경우에는 손이나 방향지시기 또는 등화로써 그 행위가 끝날 때까지 신호를 하여야 한다.”\r\n→ 신호를 하지 않으면 법 위반이므로 C는 틀린 답변이다.',0),('71ce5f89-7c44-11f0-a0df-bcfce7e0bced','zigzag_basic_1',3,'운전자는 노면표시가 있으면 반드시 그 지시에 따라야 한다.','도로교통법 제13조에 따르면 운전자는 안전표시(노면표시 포함)의 지시에 따라야 합니다.',1),('738f516d-8220-11f0-afd0-d843ae853d20','110371_basic_0',4,'전차 앞에서 급제동한다.','제19조(도로교통법 제19조) ④ **모든 차의 운전자는 급제동을 하여서는 아니 된다.**\r\n\r\n급제동은 법적으로 금지된 행위이며, 화물차 앞에서 급제동을 하는 것은 법에 어긋난다. 따라서 D는 오답이다.',0),('74fc81ba-7c47-11f0-a0df-bcfce7e0bced','110353_middle_2',3,'신호기가 없는 횡단보도 앞에서는 보행자가 없더라도 반드시 일시정지 후 진행한다.','위반 아님.\r\n→ 어린이 보호구역 내 신호기가 없는 횡단보도 앞에서는 보행자 유무와 관계없이 일시정지해야 함.\r\n→ 관련 근거 : 도로교통법 제27조(보행자의 보호) ⑦ 모든 차 또는 노면전차의 운전자는 제12조제1항에 따른 어린이 보호구역 내에 설치된 횡단보도 중 신호기가 설치되지 아니한 횡단보도 앞(정지선이 설치된 경우에는 그 정지선을 말한다)에서는 보행자의 횡단 여부와 관계없이 일시정지하여야 한다.\r\n',1),('75cd83cc-8218-11f0-afd0-d843ae853d20','154060_basic_0',1,'앞등, 사이드등, 후등 및 주차등을 모두 켜고 터널 내에서 운행한다.','도로교통법 제37조 제3항에 따르면 ‘터널 안을 운행하거나 고장 또는 그 밖의 부득이한 사유로 터널 안 도로에서 차 또는 노면전차를 정차 또는 주차하는 경우’에는 앞등, 사이드등, 후등을 켜야 한다. 따라서 조명이 어두워진 터널 진입 시 반드시 등화를 해야 한다.',1),('75d4a207-821e-11f0-afd0-d843ae853d20','98453_basic_0',4,'회전교차로에 진입하기 전 다른 차가 없으면 즉시 빠르게 통과한다.','도로교통법 제25조의2 제2항에서 “서행하거나 일시정지하여야 하며, 이미 진행하고 있는 다른 차가 있는 때에는 그 차에 진로를 양보하여야 한다.”\r\n→ 다른 차량이 없더라도 서행(혹은 일시정지) 없이 빠르게 통과하면 위험을 초래하고 법령과 맞지 않는다.\r\n\r\n또한 도로교통법 제26조 제2항에서는 “교통정리가 없는 교차로에 진입하려는 경우에는 양보해야 한다.”\r\n→ 회전교차로가 교통정리가 없는 교차로라면 양보가 필요하다.\r\n따라서 D 역시 부적절한 운전 행위다.',0),('767aa43e-7c44-11f0-a0df-bcfce7e0bced','zigzag_basic_1',4,'노면표시는 보행자에게만 해당되며 차량 운전자에게는 법적 효력이 없다.','노면표시는 보행자와 운전자 모두에게 적용됩니다.',0),('778ba15a-7c46-11f0-a0df-bcfce7e0bced','110353_middle_1',1,'공사 구간 진입 전, 우측 차로가 작업 차량으로 완전히 차단되어 있어 부득이하게 중앙선을 넘어 좌측 차로로 진행한 경우','위반 아님.\r\n→ 도로공사로 인해 우측 차선을 통행할 수 없는 경우에는 중앙선을 넘어 좌측 부분을 이용할 수 있다.\r\n→ 관련 근거 : 도로교통법 제13조(차마의 통행) ④ 차마의 운전자는 제3항에도 불구하고 다음 각 호의 어느 하나에 해당하는 경우에는 도로의 중앙이나 좌측 부분을 통행할 수 있다. 2. 도로의 파손, 도로공사나 그 밖의 장애 등으로 도로의 우측 부분을 통행할 수 없는 경우',0),('79d8c6ec-8218-11f0-afd0-d843ae853d20','154060_basic_0',2,'터널을 빠르게 통과하기 위해 속도를 높인다.','도로교통법 제65조(고속도로 진입 시의 우선순위) 등에서는 고속도로에 진입할 때 다른 차량의 통행을 방해하지 말라고 명시하지만, 속도를 증가시키는 행위가 필요하다고 규정하고 있지 않는다. 터널 내에서는 등화가 필수이며, 속도 조절은 법률상의 요구 사항이 아니다.',0),('7c566f3a-7c46-11f0-a0df-bcfce7e0bced','110353_middle_1',2,'공사 구간 진입 전, 교통정리 중인 경찰관이 수신호로 직진을 지시하지만, 전방 신호등이 적색이기 때문에 신호등 지시에 따라 정지','위반 맞음.\r\n→ 운전자는 경찰관이나 교통을 유도하는 자(공사 현장 작업자 포함)의 신호나 지시에 따라야 한다.\r\n→ 신호등보다 경찰관 또는 교통 유도자의 수신호가 우선한다.\r\n→ 따라서 수신호로 직진 지시가 있었음에도 불구하고 신호등에 따라 정지한 것은 지시에 불응한 것으로 간주된다.\r\n→ 관련 근거 : 도로교통법 제5조(신호 또는 지시에 따를 의무) ① 도로를 통행하는 보행자, 차마 또는 노면전차의 운전자는 교통안전시설이 표시하는 신호 또는 지시와 다음 각 호의 어느 하나에 해당하는 사람이 하는 신호 또는 지시를 따라야 한다. ',1),('7c6bb921-821a-11f0-afd0-d843ae853d20','154060_basic_2',1,'터널 진입 전, 명순응에 대비하여 색안경을 벗고 밤에 준하는 등화를 켠다.',' “명순응 - 어두운 곳에서 밝은 곳으로 나왔을 때 점차 밝은 빛에 적응하는 현상” 이므로 명순응이 아닌 터널을 진입할 때는 밝은 곳에서 어두운 곳으로 들어갈 때 처음에는 보이지 않던 것이 시간이 지나면 보이기 시작하는 현상인 암순응에 대비하는 것이 맞으며, 도로교통법 제37조 제3항에 따르면 ‘터널 안을 운행하거나 고장 또는 그 밖의 부득이한 사유로 터널 안 도로에서 차 또는 노면전차를 정차 또는 주차하는 경우’에는 전조등(前照燈), 차폭등(車幅燈), 미등(尾燈)을 켜야 합니다.',1),('806fe4fd-7c47-11f0-a0df-bcfce7e0bced','110353_middle_2',4,'어린이 보호구역은 모두 시속 30km로 제한되므로, 이 속도를 넘지 않으면 된다.','위반 맞음.\r\n→ 시속 30 킬로미터 기준과 다른 통행속도로 설정된 어린이 보호구역도 다수 존재함.\r\n→ 지역별로 20~40km/h 등 제한속도가 달라질 수 있음.',0),('80d7bd37-821f-11f0-afd0-d843ae853d20','98453_basic_2',1,'차로 변경이 필요하면 따로 신호 없이 변경 가능하다.','- 도로교통법 제38조(차의 신호)\r\n    \r\n    “① 모든 차의 운전자는 좌회전ㆍ우회전ㆍ횡단ㆍ유턴ㆍ서행ㆍ정지 또는 후진을 하거나 같은 방향으로 진행하면서 진로를 바꾸려고 하는 경우와 회전교차로에 진입하거나 회전교차로에서 진출하는 경우에는 손이나 방향지시기 또는 등화로써 그 행위가 끝날 때까지 신호를 하여야 한다. <개정 2022. 1. 11.>\r\n    \r\n    ② 제1항의 신호를 하는 시기와 방법은 대통령령으로 정한다.” 제1항에 따르면 차선 변경 시에 방향지시등을 킬 것을 명시하고 있습니다.',0),('81353d51-821a-11f0-afd0-d843ae853d20','154060_basic_2',2,'터널 안 차선이 백색실선인 경우, 차로를 변경하지 않고 터널을 통과한다.','도로교통법 제 22조 3항에 따르면 터널 안에서는 앞지르기가 금지되어 있으며, 앞지르기를 위해서는 차로 변경이 필수이기 때문에 터널 내의 차로 변경이 금지되어 있습니다.',0),('81cffb3a-7c46-11f0-a0df-bcfce7e0bced','110353_middle_1',3,'진로 변경이 금지된 흰색 실선이지만, 전방에 공사 구간이 있어 차선을 변경한 경우','위반 아님.\r\n→ 원칙적으로 흰색 실선 구간에서는 진로 변경이 금지된다.\r\n→ 그러나 도로공사로 장애물이 있을 경우에는 예외적으로 차선을 변경할 수 있다.\r\n관련 근거: 도로교통법 제 14조(차로의 설치 등) ⑤ 차마의 운전자는 안전표지가 설치되어 특별히 진로 변경이 금지된 곳에서는 차마의 진로를 변경하여서는 아니 된다. 다만, 도로의 파손이나 도로공사 등으로 인하여 장애물이 있는 경우에는 그러하지 아니하다.\r\n',0),('82961a3a-8213-11f0-afd0-d843ae853d20','zigzag_basic_2',1,'양보운전의 노면표시는 흰색 마름모 ’◇’(다이아몬드 모양)로 표시한다.','양보운전 노면표시는 역삼각형 ‘▽’ 입니다. 흰색 마름모는 전방에 횡단보도가 있음을 알리는 노면표시입니다.',0),('8343ec07-8218-11f0-afd0-d843ae853d20','154060_basic_0',3,'눈부심을 줄이기 위해 앞등을 끈다.','도로교통법 제37조 제2항은 ‘차량이 터널에 진입할 때 등화를 조절해야 한다’는 내용을 포함하고 있으나, 앞등을 끄는 것은 등화 의무를 위반하는 행위이며, 제37조 제1항·제3항이 요구하는 등화가 반드시 켜져 있어야 함을 명시한다. 따라서 앞등을 끄는 것은 부적절하다.',0),('8398671a-7c40-11f0-a0df-bcfce7e0bced','87769_middle_3',1,'도로교통법 제20조 양보의무 위반','제20조 제2항에 따라 교행 곤란 시 양보하지 않으면 법 위반입니다.\n',1),('848fe90f-821f-11f0-afd0-d843ae853d20','98453_basic_2',2,'회전교차로는 차선 변경 규칙이 적용되지 않는다.','회전교차로도 도로에 포함되므로 일반 차로 변경 규정이 적용됩니다.',0),('84a5befa-821a-11f0-afd0-d843ae853d20','154060_basic_2',3,'앞차와의 안전거리를 유지하면서 급제동에 대비한다.','결빙과 2차사고 등을 예방하기 위해 터널 내에서는 일반도로보다 더 안전거리를 확보하고 급제동에 대한 대비도 필요합니다.',0),('850277bc-7c3e-11f0-a0df-bcfce7e0bced','87769_middle_1',1,'승용차가 대형차보다 작으므로 무조건 후진해야 한다.','도로교통법 제20조는 차량 크기에 따른 무조건 양보 규정을 두고 있지 않습니다.\n',0),('8730af2d-821a-11f0-afd0-d843ae853d20','154060_basic_2',4,'터널 진입 전, 입구에 설치된 도로안내정보를 확인한다.','터널 내에서의 안전을 위해서 터널 진입 전 도로안내정보를 확인하는 것이 필요합니다.',0),('88263dc6-8213-11f0-afd0-d843ae853d20','zigzag_basic_2',2,'양보표지가 있는 차로를 진행 중인 차는 다른 차로의 주행차량에 차로를 양보하여야 한다.','도로교통법 제25조6항 “양보를 표시하는 안전표지가 설치되어 있는 교차로에 들어가려고 할 때에는 다른 차의 진행을 방해하지 아니하도록 일시정지하거나 양보하여야 한다.” 차량은 양보표지를 따라야 합니다.',1),('896e8f51-821f-11f0-afd0-d843ae853d20','98453_basic_2',3,'차선 변경 시 반드시 방향지시등을 켜고, 안전이 확보된 후에 변경해야 한다.','- 도로교통법 제38조(차의 신호)\r\n    \r\n    “① 모든 차의 운전자는 좌회전ㆍ우회전ㆍ횡단ㆍ유턴ㆍ서행ㆍ정지 또는 후진을 하거나 같은 방향으로 진행하면서 진로를 바꾸려고 하는 경우와 회전교차로에 진입하거나 회전교차로에서 진출하는 경우에는 손이나 방향지시기 또는 등화로써 그 행위가 끝날 때까지 신호를 하여야 한다. <개정 2022. 1. 11.>\r\n    \r\n    ② 제1항의 신호를 하는 시기와 방법은 대통령령으로 정한다.” 제1항에 따르면 차선 변경 시에 방향지시등을 키고, 안전을 확보한 이후에 차선을 변경해야 합니다.',1),('8c6e975d-8218-11f0-afd0-d843ae853d20','154060_basic_0',4,'조명이 개선될 때까지 차량을 정지한다.','도로교통법 제66조(고장 등의 조치)와 제67조(운전자의 준수사항)에서는 고장이 발생한 경우 고장표지를 설치하고 다른 곳으로 이동하도록 규정하지만, 터널 진입 시 정지를 요구하는 조항은 없다. 터널 내부에서 조명이 어두워졌을 때 차량을 정지하고 대기하는 것은 법률상 요구 사항이 아니다.',0),('8e4bcdcb-8213-11f0-afd0-d843ae853d20','zigzag_basic_2',3,'일반도로에서 차로를 변경할 때에는 30미터 전에서 신호 후 차로를 변경한다.','차로를 변경하기 30m 전에 방향지시등을 켜 주변 차량에게 차선 변경을 알리는 것은 중요합니다.',1),('9057dc6a-8225-11f0-afd0-d843ae853d20','busstop_hard_0',1,'보행자가 무단횡단했으므로 운전자는 책임이 없다.','도로교통법 제27조(보행자 보호의무), 보행자가 무단횡단하더라도 운전자는 보행자를 보호해야 할 주의의무 있음. 따라서 “책임 없다”는 잘못된 해석이다.',0),('9112759b-821f-11f0-afd0-d843ae853d20','98453_basic_2',4,'회전교차로 내의 사고 예방을 위해 차선 변경은 금지되어 있으므로 현재 차선을 유지해야 한다.','도로교통법 상 회전교차로에서의 차선 변경 금지가 규정되어 있지 않습니다.',0),('922dda5d-8226-11f0-afd0-d843ae853d20','192029_hard_1',1,'교차로에서 직진하거나 회전하는 자동차에 의한 사고가 빈번한 곳','국토교통부의 회전교차로 설계지침에 따르면 “교차로에서 직진하거나 회전하는 자동차에 의한 사고가 빈번한 경우”에서 회전교차로 설치가 권장되므로 정답입니다.',1),('92589eb5-8225-11f0-afd0-d843ae853d20','busstop_hard_0',2,'버스 전용차로 주행 자체가 위법이 될 수 있다.','도로교통법 제15조 제2항 “버스전용차로 지정 구간에서는 승용차 등은 진입할 수 없다.” 따라서 버스전용차로 주행은 위반이다.',1),('94804f7e-8226-11f0-afd0-d843ae853d20','192029_hard_1',2,'교차로에서 하나 이상의 접근로가 편도3차로 이상인 곳','국토교통부의 회전교차로 설계지침에 따르면 “교차로에서 하나 이상의 접근로가 편도3차로 이상인 경우”에서 회전교차로 설치가 금지되므로 오답입니다.',0),('94f77068-7c40-11f0-a0df-bcfce7e0bced','87769_middle_3',2,'도로교통법 제44조 음주운전 위반\n','음주운전(제44조)과는 무관합니다',0),('954139c8-8225-11f0-afd0-d843ae853d20','busstop_hard_0',3,'보행자가 도로를 점유했으므로 운전자의 위반은 성립하지 않는다.','보행자가 도로에 진입했더라도 운전자는 도로교통법 제27조에 따른 보행자 보호의무를 면할 수 없다.',0),('96e4069b-8225-11f0-afd0-d843ae853d20','busstop_hard_0',4,'버스 전용차로는 일시적으로 진입해도 무방하다.','버스전용차로는 “예외 차량(버스·승합차 등)” 외에는 어떠한 경우에도 진입 불가(도로교통법 제15조). “잠깐 진입” 허용되지 않음.',0),('96f46da0-7c46-11f0-a0df-bcfce7e0bced','110353_middle_1',4,'제한속도를 준수하고 전방 차량과의 충분한 안전거리를 유지하면서, 우측 차로의 작업 구간을 피해 좌측 차로로 변경하여 서행으로 통과한 경우','위반 아님.\r\n→ 제한속도를 준수하고, 안전거리를 확보한 상태에서 차로를 변경해 공사구간을 피하는 것은 안전운전 원칙에 부합한다.\r\n→ 관련 근거 : 도로교통법 제48조 제1항(안전운전 의무)',0),('9913ada7-8226-11f0-afd0-d843ae853d20','192029_hard_1',3,'회전교차로의 교통량 수준이 처리용량을 초과하는 곳','국토교통부의 회전교차로 설계지침에 따르면 “회전교차로의 교통량 수준이 처리용량을 초과하는 경우”에서 회전교차로 설치가 금지되므로 오답입니다.',0),('9a62f1c9-8226-11f0-afd0-d843ae853d20','192029_hard_1',4,'신호연동에 필요한 구간 중 회전교차로이면 연동효과가 감소되는 곳','국토교통부의 회전교차로 설계지침에 따르면 “신호연동이 이루어지고 있는 구간 내 교차로를 회전교차로로 전환시 연동효과를 감소시킬 수 있는 경우”에서 회전교차로 설치가 금지되므로 오답입니다.',0),('9c40cf8d-8216-11f0-afd0-d843ae853d20','left_green_right_red_basic_2',1,'교차로에 동시에 들어가려고 할 때 운전자는 좌측도로의 차에 진로를 양보해야 한다.','도로교통법 제26조(교통정리가 없는 교차로에서의 양보운전)3항 “교통정리를 하고 있지 아니하는 교차로에 동시에 들어가려고 하는 차의 운전자는 우측도로의 차에 진로를 양보하여야 한다.”에 따라 좌측도로의 차가 아니라 우측도로의 차에 진로를 양보해야 합니다.',0),('9ff2500a-8213-11f0-afd0-d843ae853d20','zigzag_basic_2',4,'원활한 교통을 위해서는 속도를 내어 차간거리를 최대한 좁혀서 운전하여야 한다.','차간거리를 좁히는 행위는 매우 위험한 행위입니다. 교통흐름에 방해가 되더라도 안전이 최우선이라는 생각으로 운행하여야 합니다.',0),('a21bde0f-8216-11f0-afd0-d843ae853d20','left_green_right_red_basic_2',2,'교차로에 선진입한 차량이 통과한 뒤 우회전한다.','도로교통법 제26조(교통정리가 없는 교차로에서의 양보운전)1항 “교통정리를 하고 있지 아니하는 교차로에 들어가려고 하는 차의 운전자는 이미 교차로에 들어가 있는 다른 차가 있을 때에는 그 차에 진로를 양보하여야 한다.”에 따라 이미 교차로에 있는 차량에게 통행 우선권이 있습니다.',1),('a2e8b4c7-7c40-11f0-a0df-bcfce7e0bced','87769_middle_3',3,'도로교통법 제5조 신호 준수 위반\n','신호 준수 의무(제5조)는 신호등·교통정리에 관한 규정입니다.',0),('a4f2d8fb-7c42-11f0-a0df-bcfce7e0bced','191130_hard_1',1,'보행자가 아직 발을 내딛지 않았으므로 그냥 통과한다.','도로교통법 제27조는 보행자가 건너려고 하는 때도 보호 대상으로 포함합니다.',0),('a6584b3b-8216-11f0-afd0-d843ae853d20','left_green_right_red_basic_2',3,'교차로에서 좌회전을 하려는 차량과 해당 교차로에서 직진이나 우회전을 하려는 다른 차량이 있을 때, 좌회전 차량이 통행 우선권을 갖는다. ','도로교통법 제26조(교통정리가 없는 교차로에서의 양보운전)4항 “교통정리를 하고 있지 아니하는 교차로에서 좌회전하려고 하는 차의 운전자는 그 교차로에서 직진하거나 우회전하려는 다른 차가 있을 때에는 그 차에 진로를 양보하여야 한다.”에 따라 직진, 우회전 차량이 통행 우선권을 갖습니다.',0),('aa0cc890-8216-11f0-afd0-d843ae853d20','left_green_right_red_basic_2',4,'넓은 도로에서 교차로에 진입하려는 차량이 있을 경우, 그 차량보다 운전자(본인)의 차량이 통행 우선권을 가진다.','도로교통법 제26조(교통정리가 없는 교차로에서의 양보운전)2항 “교통정리를 하고 있지 아니하는 교차로에 들어가려고 하는 차의 운전자는 그 차가 통행하고 있는 도로의 폭보다 교차하는 도로의 폭이 넓은 경우에는 서행하여야 하며, 폭이 넓은 도로로부터 교차로에 들어가려고 하는 다른 차가 있을 때에는 그 차에 진로를 양보하여야 한다.” 에 따라 넓은 도로에서 교차로로 진입하려는 차량이 통행 우선권을 갖습니다.',0),('b0c076c5-7c40-11f0-a0df-bcfce7e0bced','87769_middle_3',4,'도로교통법 제27조 보행자 보호 의무 위반','보행자 보호 의무(제27조)는 횡단보도 상황과 관련된 규정입니다.',0),('b5d96457-7c3a-11f0-a0df-bcfce7e0bced','87769_middle_0',1,'양 차량 모두 동시에 서행하면서 주행하여 서로 피해가도록 한다.','도로교통법 제20조 제2항 : \"좁은 도로에서 긴급자동차 외의 자동차가 서로 마주보고 진행할 때에는 다음 각 호의 구분에 따른 자동차가 도로의 우측 가장자리로 피하여 진로를 양보하여야 한다.\" \r\n두 차량이 동시에 비켜가는 것은 원칙적인 통행 방법에 위배되며, 오히려 사고 위험을 키웁니다.',0),('b927cb66-8222-11f0-afd0-d843ae853d20','87785_middle_0',1,'앞차와의 충돌을 방지하려면 우측 차선으로 이동한다.','제21조 제1항(도로교통법) – “다른 차를 앞지르려면 앞차의 좌측으로 통행하여야 한다.”\r\nA번은 우측 차선으로 이동하라는 내용이지만, 제21조 제1항은 앞 차를 앞지르려면 좌측(왼쪽) 차선으로 이동해야 한다는 규정을 두고 있다. 따라서 우측 차선 이동은 전진 시 앞 차와의 충돌 방지에 대한 적절한 조치가 아니며, 법적 근거와 일치하지 않는다.',0),('b95330c7-7c3e-11f0-a0df-bcfce7e0bced','87769_middle_1',2,'양 차량이 동시에 중앙선을 넘어 피해간다','제13조 제3항은 도로의 우측 통행을 원칙으로 하므로 중앙선 침범은 위법입니다.',0),('bb26325d-8222-11f0-afd0-d843ae853d20','87785_middle_0',2,'앞차와의 충돌을 방지하려면 좌측 차선으로 이동한다.','제21조 제1항(도로교통법) – “다른 차를 앞지르려면 앞차의 좌측으로 통행하여야 한다.”\r\nB번은 좌측 차선으로 이동을 제안하지만, 앞 차가 정지해 있는 상황에서는 앞 차를 앞지르려는 의도가 없으므로 좌측 이동이 필요 없다. 제19조 제1항에 따라 안전 거리 확보가 가장 중요한 조치이며, 좌측 차선 이동은 불필요하고 법적 근거가 부족하다.',0),('bd629021-8222-11f0-afd0-d843ae853d20','87785_middle_0',3,'전진을 멈추고, 정지한 SUV와의 충돌을 피하기 위해 필요한 거리를 확보한다.','제19조 제1항(도로교통법) – “동일한 방향으로 가고 있는 앞차의 뒤를 따르는 경우에는 앞차가 갑자기 정지한 경우 그 앞차와의 충돌을 피할 수 있는 필요한 거리를 확보하여야 한다.”\r\n정지한 SUV와의 충돌을 방지하기 위해서는 충분한 안전 거리를 확보해야 한다. 이는 제19조 제1항에 명시된 바와 같이 전진 중인 차량이 앞 차를 따를 때 가장 중요한 운전 규칙이다. 따라서 C번이 옳은 선택이다.',1),('bfb6d7b8-8222-11f0-afd0-d843ae853d20','87785_middle_0',4,'앞차가 갑자기 정지했을 때 전진을 계속한다.','제19조 제1항(도로교통법) – “동일한 방향으로 가고 있는 앞차의 뒤를 따르는 경우에는 앞차가 갑자기 정지한 경우 그 앞차와의 충돌을 피할 수 있는 필요한 거리를 확보하여야 한다.”\r\nD번은 앞 차가 갑자기 정지했음에도 전진을 계속한다는 내용으로, 제19조 제1항에 명시된 “충돌을 피할 수 있는 필요한 거리 확보”라는 의무와 명백히 모순된다.',0),('c1f52e71-7c3b-11f0-a0df-bcfce7e0bced','87769_middle_0',2,'속도가 더 빠른 차량이 우선 통행한다.','도로교통법 어디에도 속도가 빠른 차량이 우선한다는 규정은 없습니다.\r\n오히려 제20조(진로 양보의 의무)는 교행 곤란 시 일방 차량이 정지·후진하여 서로 양보할 것을 규정합니다.',0),('c560ec65-7c42-11f0-a0df-bcfce7e0bced','191130_hard_1',2,'보행자가 도로에 내려서기 전까지는 정지할 필요가 없다.','도로교통법 제27조에 따르면 발을 내딛기 전이라도 정지해야 합니다.',0),('cc040604-7c42-11f0-a0df-bcfce7e0bced','191130_hard_1',3,'횡단보도 앞에서 일시정지하여 보행자가 먼저 건너도록 해야 한다.','도로교통법 제27조 7항 : \"모든 차 또는 노면전차의 운전자는 제12조제1항에 따른 어린이 보호구역 내에 설치된 횡단보도 중 신호기가 설치되지 아니한 횡단보도 앞(정지선이 설치된 경우에는 그 정지선을 말한다)에서는 보행자의 횡단 여부와 관계없이 일시정지하여야 한다\" 에 따라 반드시 정지해야 합니다.',1),('cf38c05f-7c3d-11f0-a0df-bcfce7e0bced','87769_middle_0',3,'좁은 길에서 교행이 곤란할 때에는 일방 차량이 일시 정지하거나 후진하여 서로 통행할 수 있도록 양보한다.\n','도로교통법 제20조 제2항: “좁은 도로에서 긴급자동차 외의 자동차가 서로 마주보고 진행할 때에는 다음 각 호의 구분에 따른 자동차가 도로의 우측 가장자리로 피하여 진로를 양보하여야 한다.\r\n1. 비탈진 좁은 도로에서 자동차가 서로 마주보고 진행하는 경우에는 올라가는 자동차\r\n2. 비탈진 좁은 도로 외의 좁은 도로에서 사람을 태웠거나 물건을 실은 자동차와 동승자(同乘者)가 없고 물건을 싣지 아니한 자동차가 서로 마주보고 진행하는 경우에는 동승자가 없고 물건을 싣지 아니한 자동차”\r\n따라서 운전자 차량이 멈추고, 맞은편 차량이 후진하여 비켜주는 상황은 법 규정에 맞는 올바른 대처입니다.',1),('d26f11ad-7c42-11f0-a0df-bcfce7e0bced','191130_hard_1',4,'보행자가 서 있는 경우 속도를 줄이면 된다.','단순히 서행만으로는 의무를 다한 것이 아닙니다. 보행자 보호 의무(도로교통법 제27조 7항)에 따라 반드시 정지해야 합니다.',0),('d43b3700-7c3e-11f0-a0df-bcfce7e0bced','87769_middle_1',3,'일방 차량이 정지하거나 후진하여 서로 통행할 수 있도록 협력한다.\n','제20조 제2항: “좁은 도로에서 긴급자동차 외의 자동차가 서로 마주보고 진행할 때에는 다음 각 호의 구분에 따른 자동차가 도로의 우측 가장자리로 피하여 진로를 양보하여야 한다.”\n',1),('dcaeba23-8226-11f0-afd0-d843ae853d20','192029_hard_2',1,'정차','도로교통법 제32조(정차 및 주차의 금지)에 따르면 교차로에서 정차를 금지하고 있습니다.',1),('de988d46-8226-11f0-afd0-d843ae853d20','192029_hard_2',2,'서행','회전교차로에서 서행을 금지하는 법이나 지침은 존재하지 않습니다.',0),('e049a03c-8226-11f0-afd0-d843ae853d20','192029_hard_2',3,'앞지르기','도로교통법 제22조(앞지르기 금지의 시기 및 장소)에 따르면 교차로 안에서의 앞지르기를 금지하고 있습니다.',1),('e1e57a17-8226-11f0-afd0-d843ae853d20','192029_hard_2',4,'일시정지','도로교통법 제32조(정차 및 주차의 금지)에 따르면 교차로에서 위험방지를 위하여 일시 정지를 하는 것은 허용되고 있습니다.',0),('e5dc39ce-7c3e-11f0-a0df-bcfce7e0bced','87769_middle_1',4,'먼저 도착한 차량이 우선적으로 통행한다.','법 조항에 “먼저 도착한 차량 우선” 규정은 없습니다.\n',0),('e72f6e0b-8215-11f0-afd0-d843ae853d20','left_green_right_red_basic_0',1,' 운전자 차량이 좌회전 차로에 있고, 신호에 따라 좌회전했으므로 신호위반이 아니다.','도로교통법 제25조 제2항 “ 모든 차의 운전자는 교차로에서 좌회전을 하려는 경우에는 미리 도로의 중앙선을 따라 서행하면서 교차로의 중심 안쪽을 이용하여 좌회전하여야 한다.”에 따라 주행하고 있으므로 정답입니다.',1),('eb611f5d-8215-11f0-afd0-d843ae853d20','left_green_right_red_basic_0',2,'직진 신호가 적색이므로 운전자의 주행은 신호위반에 해당한다.','도로교통법 제25조 제2항에 따라 좌회전 차로에서 신호에 맞춰 주행하였다면 신호위반이 아니므로 오답입니다.',0),('ec29ff6d-8221-11f0-afd0-d843ae853d20','110369_middle_0',1,'칼라콘(라바콘)을 피해 차로를 변경할 때, 비상 점멸등을 켜야 한다.','도로교통법 제 13조 4항 “차마의 운전자는 제3항에도 불구하고 다음 각 호의 어느 하나에 해당하는 경우에는 도로의 중앙이나 좌측 부분을 통행할 수 있다. - 도로의 파손, 도로공사나 그 밖의 장애 등으로 도로의 우측 부분을 통행할 수 없는 경우”에 해당하므로 좌측통행이 허용되지만 비상 점멸등을 키는 것을 권고합니다.',1),('ed5f265a-8216-11f0-afd0-d843ae853d20','left_green_right_red_basic_3',1,'마주 오는 차량이 없을 때 반드시 녹색등화에서 좌회전을 해야한다.','도로교통공단에 따르면 비보호 좌회전은 비보호 좌회전 안전표지가 있고, 차량 신호가 녹색 신호고, 마주 오는 차량이 없을 때 좌회전할 수 있습니다.',1),('eff24adf-8215-11f0-afd0-d843ae853d20','left_green_right_red_basic_0',3,'좌회전 신호가 녹색이므로 모든 차량이 방향에 상관없이 주행 가능하다.','좌회전 신호는 좌회전 차로 차량에게만 적용. 모든 차량이 진행 가능한 것이 아니므로 오답입니다.',0),('f16a8aea-8216-11f0-afd0-d843ae853d20','left_green_right_red_basic_3',2,'마주 오는 차량이 모두 정지선 직전에 정지하는 적색등화에서 좌회전을 해야한다.','도로교통공단에 따르면 비보호 좌회전은 비보호 좌회전 안전표지가 있고, 차량 신호가 녹색 신호고, 마주 오는 차량이 없을 때 좌회전할 수 있습니다.',0),('f304e6cd-8215-11f0-afd0-d843ae853d20','left_green_right_red_basic_0',4,'직진 차로에서 출발했더라도 좌회전으로 방향을 바꿨기 때문에 신호위반이 아니다.','차로 선택과 무관하게 “신호등 지시를 따라야 함”(제5조). 직진 차로에서 적색에 출발하면 위반이므로 오답입니다.',0),('f334ee05-8221-11f0-afd0-d843ae853d20','110369_middle_0',2,'맞은편 차량을 발견했을 때, 속도를 줄이면서 중앙선에서 주행한다.','“도로교통법 제13조 제3항”에 명시된 “차마의 운전자는 도로(보도와 차도가 구분된 도로에서는 차도를 말한다)의 중앙(중앙선이 설치되어 있는 경우에는 그 중앙선을 말한다. 이하 같다) 우측 부분을 통행하여야 한다.”(즉, 우측 차선 사용이 허용됨)를 근거로, 반대 차로에서 차량이 오는 상황에서는 우측 차선으로 돌아가서 차간격을 확보하고 안전을 확보해야 함을 의미합니다.',0),('f3d09a2d-7c3f-11f0-a0df-bcfce7e0bced','87769_middle_2',1,'속도를 올려 먼저 통과한다.','속도를 올리면 사고 위험이 커지며 도로교통법 제1조(안전 확보의 기본 원칙)에 반합니다.',0),('f5f8fff3-8216-11f0-afd0-d843ae853d20','left_green_right_red_basic_3',3,'녹색등화에서 비보호 좌회전할 때 사고가 나면 안전운전의무 위반으로 처벌받는다.','도로교통공단에 따르면 녹색 등화에서 비보호 좌회전 때 사고가 발생하면 2010.8.24. 이후 안전운전의무 위반으로 처벌됩니다.',1),('f6e0a91c-7c43-11f0-a0df-bcfce7e0bced','zigzag_basic_0',1,'차량을 좌우로 흔들며 주행하라는 의미이다.','한국도로교통공단의 “교통안전시설(노면표시) 설치·관리 업무편람”에 따르면 지그재그 노면표시는 보행자 보호 및 서행 의무를 강조하는 표시이므로 해당 선지는 오답입니다.',0),('f78dfd3d-8221-11f0-afd0-d843ae853d20','110369_middle_0',3,'전조등을 켜 접근하는 맞은편 차량에게 정지할 것을 요청한다.','도로교통법 제37조(차와 노면전차의 등화) : ”모든 차 또는 노면전차의 운전자는 다음 각 호의 어느 하나에 해당하는 경우에는 대통령령으로 정하는 바에 따라 전조등(前照燈), 차폭등(車幅燈), 미등(尾燈)과 그 밖의 등화를 켜야 한다.”에서 영상 속 상황이 해당 상황에 포함되지 않으므로 오답입니다.',0),('f8fb34a9-8216-11f0-afd0-d843ae853d20','left_green_right_red_basic_3',4,'적색등화에서 비보호 좌회전할 때 사고가 나면 안전운전의무 위반으로 처벌받는다.','도로교통공단에 따르면 녹색 등화에서 비보호 좌회전 때 사고가 발생하면 2010.8.24. 이후 안전운전의무 위반으로 처벌됩니다.',0),('f99a4644-8221-11f0-afd0-d843ae853d20','110369_middle_0',4,'칼라콘(라바콘)을 피해 차로를 변경할 때, 방향 지시등을 켜 주변 차량에게 차로 변경을 알린다.','방향 지시등이 아닌 비상 점멸등을 켜야하기 때문에 오답입니다.',0),('fd0d7245-7c43-11f0-a0df-bcfce7e0bced','zigzag_basic_0',2,'차량의 속도를 줄이고 보행자 안전을 확보하라는 의미이다.','지그재그 노면표시는 서행 안전표지는 “교통안전시설(노면표시) 설치·관리 업무편람”에 따라 서행의 의미이며, 도로교통법 제31조(서행 또는 일시정지할 장소)1항 “모든 차 또는 노면전차의 운전자는 다음 각 호의 어느 하나에 해당하는 곳에서는 서행하여야 한다. - 시ㆍ도경찰청장이 도로에서의 위험을 방지하고 교통의 안전과 원활한 소통을 확보하기 위하여 필요하다고 인정하여 안전표지로 지정한 곳”에 따라 법적 효력을 가집니다.',1);
/*!40000 ALTER TABLE `options` ENABLE KEYS */;
UNLOCK TABLES;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
/*!50003 CREATE*/ /*!50017 DEFINER=`root`@`localhost`*/ /*!50003 TRIGGER `bi_options_uuid` BEFORE INSERT ON `options` FOR EACH ROW BEGIN
  IF NEW.`option_id` IS NULL OR NEW.`option_id`='' THEN SET NEW.`option_id`=UUID(); END IF;
END */;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;

--
-- Table structure for table `quiz`
--

DROP TABLE IF EXISTS `quiz`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `quiz` (
  `quiz_id` varchar(36) NOT NULL COMMENT 'PK. 퀴즈 고유번호',
  `video_id` varchar(36) DEFAULT NULL COMMENT 'FK → video.video_id',
  `question_text` text COMMENT '문제 본문',
  `category_id` varchar(36) DEFAULT NULL COMMENT 'FK → category.category_id',
  PRIMARY KEY (`quiz_id`),
  KEY `video_id_idx` (`video_id`),
  KEY `category_id_idx` (`category_id`),
  CONSTRAINT `fk_quiz_category` FOREIGN KEY (`category_id`) REFERENCES `category` (`category_id`) ON DELETE SET NULL ON UPDATE CASCADE,
  CONSTRAINT `fk_quiz_video` FOREIGN KEY (`video_id`) REFERENCES `video` (`video_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='퀴즈(문제) : 영상, 문제 본문, 상황 유형';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `quiz`
--

LOCK TABLES `quiz` WRITE;
/*!40000 ALTER TABLE `quiz` DISABLE KEYS */;
INSERT INTO `quiz` VALUES ('110353_middle_0','middle_110353','다음은 한 운전자가 주행 중 경험한 실제 도로 상황이다. 다음 중 도로교통법상 **명백한 위반**에 해당하는 행동은 무엇인가?',NULL),('110353_middle_1','middle_110353','다음 중 공사 구간을 통행하는 운전자의 행위 중 도로교통법상 위법에 해당하는 것은 무엇인가?',NULL),('110353_middle_2','middle_110353','다음 중 도로교통법상 어린이 보호구역 내에서 올바른 주행 방법에 해당하는 것을 모두 고르시오.',NULL),('110353_middle_3','middle_110353','다음 중 적색으로 포장된 아스팔트 구간이 아닌 것은?',NULL),('110369_middle_0','middle_110369','영상을 보았을 때, 다음 중 올바른 조치로 옳은 것은?',NULL),('110371_basic_0','basic_110371','전방에 화물차가 앞서고 있어 차선이 막혔을 때, 운전자는 어떻게 행동해야 하나요?',NULL),('131062_hard_0','hard_131062','교차로에서 운전자 차량이 직진을 하고 있다. 교차로 전방 신호는 적색 점멸 신호(빨간불이 깜빡임)이다. 교차로 한가운데에서 운전자 차량과 검은색 차량이 부딪히는 사고가 발생한다. 해당 상황에서 사고를 피하려면 운전자가 어떤 행동을 했어야 하는가?',NULL),('131062_hard_1','hard_131062','교차로에서 좌/우회전하는 방법을 가장 바르게 설명한 것은?',NULL),('149112_hard_0','hard_149112','우회전 중 검은색 세단과 충돌한 경우, 충돌 방지 책임을 지는 운전자를 올바르게 기술한 것은?',NULL),('154060_basic_0','basic_154060','터널에 진입하면서 조명이 어두워지는 상황에서 운전자는 어떤 조치를 취해야 합니까?',NULL),('154060_basic_1','basic_154060','다음 중 앞지르기가 가능한 장소는?',NULL),('154060_basic_2','basic_154060','다음 중 터널을 통과할 때 운전자의 안전수칙으로 잘못된 것은?',NULL),('191130_hard_0','hard_191130','영상에서 운전자 차량이 우회전 후 녹색 신호에서 진행하던 중, 횡단보도를 건너는 보행자와 충돌했다. \r\n이 상황에 대한 올바른 법적 해석은 무엇인가?',NULL),('191130_hard_1','hard_191130','운전자가 신호등 없는 횡단보도에 접근했을 때, 보행자가 길을 건너려고 기다리고 있다면 운전자는 어떻게 해야 하는가?',NULL),('191130_hard_2','hard_191130','운전자가 우회전할 때 횡단보도에 보행자가 통행 중인 경우, 운전자의 옳은 조치는?',NULL),('192029_hard_0','hard_192029','해당 영상은 회전교차로 내의 차대차 충돌영상이다. 영상에 대한 설명으로 옳은 것은?',NULL),('192029_hard_1','hard_192029','도로의 원활한 소통과 안전을 위하여 회전교차로의 설치가 필요한 곳은?',NULL),('192029_hard_2','hard_192029','다음 중 회전교차로에서의 금지 행위인 것을 모두 고르시오.',NULL),('192029_hard_3','hard_192029','다음 중 회전교차로에서 통행 우선권이 보장된 회전차량은?',NULL),('87768_middle_0','middle_87768','다음 중 도로교통법에 따라 “전방 정체가 생겼을 때” Ego 차량이 정지할 수 있는 행위에 대한 설명으로 가장 적절한 것은?',NULL),('87769_middle_0','middle_87769','영상에서 주행 방향이 정해지지 않은 좁은 골목길에서 운전자 차량과 맞은편 차량이 마주쳤다. \n이때 운전자가 취해야 할 올바른 조치는 무엇인가?\n',NULL),('87769_middle_1','middle_87769','좁은 골목길에서 대형 버스와 승용차가 마주쳤다. 이때 교행이 곤란하다면 어떻게 해야 하는가?\n',NULL),('87769_middle_2','middle_87769','좁은 도로에서 마주 오는 차량과 교행할 수 없는 경우, 운전자가 가장 먼저 해야 할 올바른 행동은 무엇인가?',NULL),('87769_middle_3','middle_87769','교행이 곤란한 도로에서 마주 오는 차량이 서로 양보하지 않고 계속 진행한다면, 어떤 법 위반이 될 수 있는가?\n',NULL),('87785_middle_0','middle_87785','전진 중인 차량이 앞에 정지해 있는 SUV(스포츠 유틸리티 차량)를 마주할 때, 운전자는 무엇을 해야 하는가?',NULL),('87785_middle_1','middle_87785','도로교통법령상 차로에 따른 통행차의 기준에 대한 설명이다. 잘못된 것은?',NULL),('87785_middle_2','middle_87785','도로교통법령상 차로에 따른 통행구분 설명이다. 잘못된 것은?',NULL),('98453_basic_0','basic_98453','Ego 차량이 회전교차로에 진입할 때 가장 적절한 운전 행위는?',NULL),('98453_basic_1','basic_98453','다음 중 회전교차로를 통행 중인 운전자의 행동으로 적절한 것을 모두 고르시오.',NULL),('98453_basic_2','basic_98453','회전교차로 안에서 2차로로 주행 중이던 차량이 차선을 변경하려고 한다. 이때 올바른 방법은?',NULL),('busstop_hard_0','hard_busstop','영상과 같이 운전자 차량이 보행자와 충돌한 경우, 도로교통법상 위반에 해당하는 것은 무엇인가?',NULL),('left_green_right_red_basic_0','basic_left_green_right_red','영상에서의 운전자 차량의 주행에 대한 도로교통법상 옳은 판단은 무엇인가?',NULL),('left_green_right_red_basic_1','basic_left_green_right_red','교차로에서 좌회전할 때 가장 위험한 요인은?',NULL),('left_green_right_red_basic_2','basic_left_green_right_red','신호등이 없는 교차로에서의 옳은 것은?',NULL),('left_green_right_red_basic_3','basic_left_green_right_red','비보호좌회전 교차로에서 좌회전하고자 할 때의 설명으로 옳은 것을 모두 고르시오.',NULL),('zigzag_basic_0','basic_zigzag','이 영상에서 도로의 “지그재그” 노면표시는 무엇을 의미하는가?',NULL),('zigzag_basic_1','basic_zigzag','다음 중 노면표시에 대한 설명으로 옳은 것은 무엇인가?',NULL),('zigzag_basic_2','basic_zigzag','다음 설명 중 옳은 것을 모두 고르시오.',NULL);
/*!40000 ALTER TABLE `quiz` ENABLE KEYS */;
UNLOCK TABLES;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
/*!50003 CREATE*/ /*!50017 DEFINER=`root`@`localhost`*/ /*!50003 TRIGGER `bi_quiz_uuid` BEFORE INSERT ON `quiz` FOR EACH ROW BEGIN
  IF NEW.`quiz_id` IS NULL OR NEW.`quiz_id`='' THEN SET NEW.`quiz_id`=UUID(); END IF;
END */;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `user_id` varchar(36) NOT NULL COMMENT 'PK. 사용자 고유번호',
  `name` varchar(100) DEFAULT NULL COMMENT '사용자 이름',
  `phone` varchar(20) DEFAULT NULL COMMENT '전화번호',
  `email` varchar(255) DEFAULT NULL COMMENT '이메일(아이디)',
  `password_hash` varchar(255) DEFAULT NULL COMMENT '비밀번호',
  `birth_date` date DEFAULT NULL COMMENT '생년월일',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '회원가입 시각',
  PRIMARY KEY (`user_id`),
  UNIQUE KEY `email_UNIQUE` (`email`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='사용자 정보';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES ('5e41e578-7d8a-11f0-895c-d843ae853d20','김민준','010-1001-0001','user01@example.com','69c36aa1e100131f4946de5cecd8859b4223a63e8675f408c485da1ce3d95c81','1996-03-21','2025-08-20 05:56:08'),('70599b73-7c49-11f0-a0df-bcfce7e0bced','이서연','010-1001-0002','user02@example.com','cb742b476b33e3623485957c7b759f882ef14c0bda0c2e871abc7336ef37c3c4','1998-07-12','2025-08-18 15:38:50'),('70599c30-7c49-11f0-a0df-bcfce7e0bced','박지후','010-1001-0003','user03@example.com','96531a1844bfcd1e4ba0e17b21b2c6b18f90d1b5f7e7498cb549d0c6bb5e6705','1995-11-05','2025-08-18 15:38:50'),('70599c86-7c49-11f0-a0df-bcfce7e0bced','최윤서','010-1001-0004','user04@example.com','852992f7ccaedddb1c4f1d19232eaa62c36505ae562c09f1dca26b65479baab0','2000-01-30','2025-08-18 15:38:50'),('70599cdd-7c49-11f0-a0df-bcfce7e0bced','김운전','010-1001-0005','user05@example.com','85fd54ef075a11990d586ff41ec151257f3091eccbf4ee26d3f705198de6a06c','1996-03-21','2025-08-18 15:38:50');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
/*!50003 CREATE*/ /*!50017 DEFINER=`root`@`localhost`*/ /*!50003 TRIGGER `bi_users_uuid` BEFORE INSERT ON `users` FOR EACH ROW BEGIN
  IF NEW.`user_id` IS NULL OR NEW.`user_id`='' THEN SET NEW.`user_id`=UUID(); END IF;
END */;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;

--
-- Table structure for table `video`
--

DROP TABLE IF EXISTS `video`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `video` (
  `video_id` varchar(36) NOT NULL COMMENT 'PK. 영상 고유번호',
  `video_url` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '영상 URL',
  `difficulty` tinyint unsigned NOT NULL COMMENT '난이도 (상:1, 중:2, 하:3)',
  `description` text COMMENT '도로 주행 상황 설명 텍스트',
  PRIMARY KEY (`video_id`),
  CONSTRAINT `chk_video_difficulty` CHECK ((`difficulty` between 1 and 3))
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='영상';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `video`
--

LOCK TABLES `video` WRITE;
/*!40000 ALTER TABLE `video` DISABLE KEYS */;
INSERT INTO `video` VALUES ('basic_110371','https://drive.google.com/file/d/1m1iGLvHnc-aN9ffFGO9sJfa-TxegBZ2c/view?usp=drive_link',3,'Ego 차량이 차로 구분이 없는 도로에서 주행 중이다. Ego 차량이 전방에 비신호 3지 교차로를 직진하여 통과한다. 전방 우측에 황색 실선을 경계로 차들이 정차 중이다. 전방 맞은편에서 보행자 2명이 자동차 주행 도로로 지나가고 있다. 전방 좌측에 황색 실선을 경계로 차들이 정차 중이다. 전방에 화물차가 정차 중이다. Ego 차량이 화물차를 회피 주행하기 위해 정차하여 맞은편 차량이 지나가기까지 대기한다. Ego 차량이 맞은편 차량이 지나가고 전방의 화물차를 회피 주행한다. 전방에 황색 실선 밖으로 차량이 정차 중이다.'),('basic_154060','https://drive.google.com/file/d/1ATOtZZxslpTP3xYmxtD4NKJSzCw1_x85/view?usp=drive_link',3,'요약: 동영상에는 자동차가 고속도로를 달리며 다른 차량을 지나 터널로 들어가는 모습이 담겨 있습니다.\r\n\r\n이벤트:\r\n1. 차는 양쪽에 푸른 하늘과 푸른 나무가 있는 고속도로를 달리고 있습니다.\r\n2. 검은색 자동차가 에고 차량 앞을 달리고 있습니다.\r\n3. 에고 차량이 앞으로 주행하면서 검은색 차량을 따라갑니다.\r\n4. 에고 차량이 도로 오른쪽에서 흰색 트럭을 지나갑니다.\r\n5. 자아 차량은 터널로 들어가며, 터널이 진행될수록 더 어두워집니다.\r\n6. 자동차는 터널을 계속 주행하며, 출구로 나갈수록 빛이 점차 증가합니다.'),('basic_98453','https://drive.google.com/file/d/1oWO7-BRGvAMg0tG7ZRECNN0tXyjwqCRR/view?usp=drive_link',3,'Ego 차량이 편도 2차로 도로의 2차로에서 주행 중이다. 전방 1차로에 세단이 주행 중이다. 전방 2차로에 세단이 주행 중이다. 전방의 SUV 2대가 원형교차로에 진입한다. 원형교차로 3시 방향 입구에 세단이 진입 대기 중이다. 전방 2차로의 세단이 원형교차로에 진입한다. 전방 원형교차로 2차로의 SUV가 3시 방향 출구로 원형교차로를 이탈한다. 전방 1차로의 세단이 원형교차로에 진입한다. Ego 차량이 원형교차로에 진입한다. 전방 2차로의 SUV가 12시 방향으로 원형교차로를 이탈한다. 전방 2차로의 세단이 원형교차로를 이탈한다. 전방 1차로의 세단이 원형교차로를 이탈한다. Ego 차량이 원형교차로를 이탈한다.'),('basic_left_green_right_red','https://drive.google.com/drive/folders/1i6c_hiIPE-urOo1Z9vy1NPByHc-OBL5a',3,'요약 : 이 동영상은 여러 개의 신호등과 차량이 있는 도시 거리를 보여줍니다. ego 차량은 교차로를 통과하면서 흰색 밴을 따라가고 있습니다.\r\n\r\n이벤트 :\r\n1. ego 차량이 교차로에 진입하며 앞서 가는 흰색 밴을 따르고 있습니다.  2. 교차로의 직진 신호등은 빨간색입니다. 3. 전방 신호등의 좌회전 신호는 녹색으로, 흰색 밴과 ego 차량 모두 좌회전하여 교차로를 통과합니다.'),('basic_zigzag','https://drive.google.com/file/d/1mSMRW9hfs0n5mnjUR-Q9UQFAQMIZTkhU/view?usp=drive_link',3,'이 영상은 여러 차선과 교통 신호가 있는 도시 거리를 보여줍니다.\r\n도로는 넓고 여러 차선으로 나뉘어 있으며, 도로 위에 지그재그 형태의 서행 안전표지가 있어, ego 차량은 서행을 합니다.\r\n직진 방향 신호등이 녹색이기 때문에 ego 차량은 직진 주행합니다.'),('hard_131062','https://drive.google.com/file/d/1o_ysgGeucNY7EuvP23vsj5APlzEk40q9/view?usp=drive_link',1,'운전자 차량이 교차로에 다가간다.\r\n교차로 전방 신호는 적색 점멸 신호이다.\r\n운전자 차량이 일시정지하지 않고 직진한다.\r\n교차로의 오른쪽에서 직진하던 차량과 운전자 차량이 충돌한다.'),('hard_149112','https://drive.google.com/file/d/1UQzHkz-hpU0H6Dk9mi9_8E0Jvpb_5VjK/view?usp=drive_link',1,'운전자 차량은 편도 1차선 도로를 주행 중입니다.\r\n사거리 교차로의 전방신호는 적색 신호입니다.\r\n녹색 버스에 접근한 운전자는 사거리 교차로에 가까워지자 속도를 줄입니다.\r\n운전자가 교차로에서 정지하지 않고 우회전을 합니다.\r\n운전자가 진입하려는 방향의 도로에서 비보호 좌회전을 시도하는 검은색 세단이 나타납니다.\r\n교차로에서 운전자 차량과 검은색 세단이 충돌합니다.\r\n검은색 세단과 에고 차량은 충돌 후 교차로에 정차합니다.'),('hard_191130','https://drive.google.com/drive/folders/1i6c_hiIPE-urOo1Z9vy1NPByHc-OBL5a?usp=drive_link',1,'ego차량은 우회전해서 횡단보도에 접근합니다.\r\n신호등이 녹색이어서 차량이 진행 가능합니다.\r\n횡단보도에 접근하면서 앞쪽에서 길을 건너는 보행자를 발견합니다.\r\n보행자는 횡단보도를 건너고 있습니다.\r\nego차량은 멈추지 않고 계속 전진해서 보행자와 충돌합니다.'),('hard_192029','https://drive.google.com/file/d/1ZtZBwdFXPa33Lx3BqXEm7788_RVof-sr/view?usp=drive_link',1,NULL),('hard_busstop','https://drive.google.com/file/d/1lbKnHtLEaBpdNx2LjuhajjcN0aRrnGIt/view?usp=drive_link',1,'에고 차량은 3차선 도로의 중간 차선을 주행합니다. \r\n에고 차량이 차선을 바꿔 버스 전용차로로 주행합니다.\r\n보행자가 갑자기 무단횡단하여 버스 전용차로 도로로 들어서고, 자아 차량과 보행자 간의 충돌이 발생합니다. \r\n보행자가 바닥에 쓰러지고 에고 차량은 주행을 멈춥니다.'),('middle_110353','https://drive.google.com/drive/folders/1i6c_hiIPE-urOo1Z9vy1NPByHc-OBL5a?usp=drive_link',2,'영상은 나무가 줄지어 있고 오른쪽에 검은색 울타리가 있는 다중 차선 도로를 주행하는 에고 차량으로 시작됩니다. 도로에는 노란색 경계선과 \"30\"을 나타내는 속도 제한 표지판이 있습니다. 차량은 일정한 속도를 유지합니다 \r\n앞에 있는 건설 구역에 접근합니다.\r\n\r\n차량이 계속 진행되는 동안 교통 콘 근처에 주차된 흰색 픽업 트럭과 노란색 유틸리티 트럭을 만나게 됩니다 \r\n픽업트럭은 정지해 있고 유틸리티 트럭이 일부 작업에 참여하고 있는 것으로 보입니다. 교통 콘은 차선을 차단하도록 배치되어 있어 공사가 진행 중임을 나타냅니다.\r\n\r\n차량은 건설 구역을 통과하여 정지해 있는 트럭을 지나 도로를 따라 계속 이어갑니다. 도로에는 여러 차선이 있으며, 에고 차량은 왼쪽 차선에서 위치를 유지합니다. 주변 환경에는 나무, 검은색 울타리, 도로 측면을 따라 늘어선 건물이 있습니다.\r\n\r\n그런 다음 차량은 신호등이 보이는 교차로에 접근합니다. 신호등은 양방향에 녹색 신호를 표시하여 차량이 교차로를 안전하게 통과할 수 있도록 합니다. 도로는 더 이상 공사나 장애물이 보이지 않는 상태로 직진합니다.\r\n\r\n영상 내내 에고 차량은 신중한 자세를 유지하며 도로 규칙을 준수하여 공사 구역과 교차로를 안전하게 주행할 수 있도록 보장합니다.'),('middle_110369','https://drive.google.com/file/d/1xuC_HsIJIZl1RRo5HYXFIR8cFP_M6C-K/view?usp=drive_link',2,'영상은 ego 차량이 교차로에 접근하는 것으로 시작됩니다.\r\nego 차량은 교차로를 지나 2차선 도로로 진입해 직진합니다.\r\nego 차량이 편도 1차선 도로로 진입합니다.\r\nego 차량은 도로 위에 주황색 콘이 있는 공사 구간을 만납니다.\r\nego 차량은 콘을 피해 중앙선을 침범하여 좌측의 반대 차로로 차선을 변경해 공사 구역을 피합니다.\r\nego 차량은 반대 차로에서 SUV 두 대가 오는 것을 확인하고, 차량들을 피하기 위해 우측의 원래 차로로 돌아갑니다.'),('middle_87768','https://drive.google.com/file/d/1W16jFUkpBQiTUVIiS1S-UlvVa5cEPfVi/view?usp=drive_link',2,'Ego 차량이 편도 2차로 도로에서 주행 중이다. Ego 차량이 어린이 보호 구역의 1차로에서 직진 주행 중이다. 전방 1차로에 SUV가 있다. 전방 2차로에 화물차가 있다. 전방 녹색 신호에 따라 1차로의 SUV는 직진 주행하지만 2차로의 화물차는 정체로 인해 대기 중이다. 전방 2차로에 SUV가 정차 중이다. 전방 2차로에 화물차가 정차 중이다. Ego 차량이 녹색 신호를 받고 있지만 전방 정체 상황에 따라 정차한다. 전방 1차로의 SUV가 정차한다.'),('middle_87769','https://drive.google.com/file/d/1z5k3CMh9j_HB8MNK30vcj3Pdc77Y81gv/view?usp=drive_link',2,'요약: 동영상은 양쪽에 나무와 건물이 있는 주택가를 주행하는 자동차를 보여줍니다.\n\n이벤트:\n1. ego 차량은 주행 방향이 정해지지 않은 골목길을 따라 곧장 운전합니다.\n2. ego 차량의 맞은편에서 흰색 차가 다가옵니다.\n3. ego 차량은 맞은편의 흰색 차량을 확인하고 정지합니다.\n4. 흰색 차량이 ego 차량을 피해 후진으로 골목길에서 이탈합니다.\n5. ego 차량은 골목길에서 직진하고, 보행자 건널목과 교차하는 지점에서 우회전합니다.'),('middle_87785','https://drive.google.com/file/d/1FJqyqvJK9OmLYxZXV378lDkurI0Cc2n6/view?usp=drive_link',2,'Ego 차량이 편도 5차로 도로에서 주행 중이다. Ego 차량이 4차로에서 직진 주행 중이다. 우회전 차량들이 우측 도로 진입 전 우측의 횡단보도 앞에서 정차 중이다. 전방 4차로에서 SUV가 직진 주행 중이다. 전방 4차로의 SUV가 직진 우회전 차로에서 우회전한다. 정차 중인 우회전 차량들에 의해 전방 4차로의 SUV가 정차한다. Ego 차량이 정차 중인 전방 4차로의 SUV를 좌측 차로로 회피한다. 좌측 차로로 SUV가 추월 주행한다. 좌측 차로로 화물차가 추월 주행한다. Ego 차량이 교차로를 통과한다. Ego 차량이 직진 주행한다.');
/*!40000 ALTER TABLE `video` ENABLE KEYS */;
UNLOCK TABLES;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
/*!50003 CREATE*/ /*!50017 DEFINER=`root`@`localhost`*/ /*!50003 TRIGGER `bi_video_uuid` BEFORE INSERT ON `video` FOR EACH ROW BEGIN
  IF NEW.`video_id` IS NULL OR NEW.`video_id`='' THEN SET NEW.`video_id`=UUID(); END IF;
END */;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;

--
-- Table structure for table `wrong_note`
--

DROP TABLE IF EXISTS `wrong_note`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `wrong_note` (
  `wrong_note_id` varchar(36) NOT NULL COMMENT 'PK. 오답 노트 고유번호',
  `user_id` varchar(36) NOT NULL COMMENT 'FK → users.user_id',
  `wrong_quiz_id` varchar(36) DEFAULT NULL COMMENT 'FK → quiz.quiz_id',
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`wrong_note_id`),
  UNIQUE KEY `uq_wrong_note_user_quiz` (`user_id`,`wrong_quiz_id`),
  KEY `user_id_idx` (`user_id`),
  KEY `wrong_quiz_id_idx` (`wrong_quiz_id`),
  CONSTRAINT `fk_wn_quiz` FOREIGN KEY (`wrong_quiz_id`) REFERENCES `quiz` (`quiz_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `fk_wn_user` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='오답 노트';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `wrong_note`
--

LOCK TABLES `wrong_note` WRITE;
/*!40000 ALTER TABLE `wrong_note` DISABLE KEYS */;
INSERT INTO `wrong_note` VALUES ('08cc553f-7d8c-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20','110353_middle_2','2025-08-20 15:08:04'),('08cc59e9-7d8c-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20','110353_middle_3','2025-08-20 15:08:04'),('08cc6187-7d8c-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20','zigzag_basic_1','2025-08-20 15:08:04'),('43a2a884-7c4e-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced','87769_middle_0','2025-08-19 01:13:23'),('43a2a972-7c4e-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced','87769_middle_2','2025-08-19 01:13:23'),('43a2aa5c-7c4e-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced','87769_middle_3','2025-08-19 01:13:23'),('43a2ab66-7c4e-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced','110353_middle_0','2025-08-19 01:13:23'),('43a2ac3a-7c4e-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced','191130_hard_0','2025-08-19 01:13:23'),('43a2ad1a-7c4e-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced','zigzag_basic_0','2025-08-19 01:13:23'),('43a2adec-7c4e-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced','zigzag_basic_1','2025-08-19 01:13:23'),('43a2aed1-7c4e-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced','110353_middle_2','2025-08-19 01:13:23'),('43a2af9c-7c4e-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced','191130_hard_1','2025-08-19 01:13:23'),('43a2b085-7c4e-11f0-a0df-bcfce7e0bced','70599b73-7c49-11f0-a0df-bcfce7e0bced','87769_middle_1','2025-08-19 01:13:23'),('43a2b14e-7c4e-11f0-a0df-bcfce7e0bced','70599c30-7c49-11f0-a0df-bcfce7e0bced','110353_middle_0','2025-08-19 01:13:23'),('43a2b22c-7c4e-11f0-a0df-bcfce7e0bced','70599c30-7c49-11f0-a0df-bcfce7e0bced','191130_hard_1','2025-08-19 01:13:23'),('43a2b304-7c4e-11f0-a0df-bcfce7e0bced','70599c30-7c49-11f0-a0df-bcfce7e0bced','zigzag_basic_1','2025-08-19 01:13:23'),('43a2b3d5-7c4e-11f0-a0df-bcfce7e0bced','70599c30-7c49-11f0-a0df-bcfce7e0bced','87769_middle_2','2025-08-19 01:13:23'),('43a2b4a1-7c4e-11f0-a0df-bcfce7e0bced','70599c30-7c49-11f0-a0df-bcfce7e0bced','191130_hard_2','2025-08-19 01:13:23'),('43a2b572-7c4e-11f0-a0df-bcfce7e0bced','70599c86-7c49-11f0-a0df-bcfce7e0bced','110353_middle_2','2025-08-19 01:13:23'),('43a2b642-7c4e-11f0-a0df-bcfce7e0bced','70599c86-7c49-11f0-a0df-bcfce7e0bced','110353_middle_3','2025-08-19 01:13:23'),('43a2b715-7c4e-11f0-a0df-bcfce7e0bced','70599c86-7c49-11f0-a0df-bcfce7e0bced','191130_hard_0','2025-08-19 01:13:23'),('43a2b7e5-7c4e-11f0-a0df-bcfce7e0bced','70599c86-7c49-11f0-a0df-bcfce7e0bced','87769_middle_0','2025-08-19 01:13:23'),('43a2b8b0-7c4e-11f0-a0df-bcfce7e0bced','70599c86-7c49-11f0-a0df-bcfce7e0bced','zigzag_basic_0','2025-08-19 01:13:23'),('43a2b998-7c4e-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced','87769_middle_1','2025-08-19 01:13:23'),('43a2ba5c-7c4e-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced','87769_middle_2','2025-08-19 01:13:23'),('43a2bb33-7c4e-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced','87769_middle_3','2025-08-19 01:13:23'),('43a2bc16-7c4e-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced','191130_hard_0','2025-08-19 01:13:23'),('43a2bce8-7c4e-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced','110353_middle_1','2025-08-19 01:13:23'),('43a2bdbb-7c4e-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced','zigzag_basic_0','2025-08-19 01:13:23'),('43a2be8a-7c4e-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced','110353_middle_0','2025-08-19 01:13:23'),('43a2bf57-7c4e-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced','110353_middle_2','2025-08-19 01:13:23'),('43a2c044-7c4e-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced','191130_hard_2','2025-08-19 01:13:23'),('43a2c117-7c4e-11f0-a0df-bcfce7e0bced','70599cdd-7c49-11f0-a0df-bcfce7e0bced','zigzag_basic_1','2025-08-19 01:13:23'),('d2447223-7d8a-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20','191130_hard_0','2025-08-20 14:59:23'),('d2447e5d-7d8a-11f0-895c-d843ae853d20','5e41e578-7d8a-11f0-895c-d843ae853d20','zigzag_basic_0','2025-08-20 14:59:23');
/*!40000 ALTER TABLE `wrong_note` ENABLE KEYS */;
UNLOCK TABLES;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
/*!50003 CREATE*/ /*!50017 DEFINER=`root`@`localhost`*/ /*!50003 TRIGGER `bi_wrong_note_uuid` BEFORE INSERT ON `wrong_note` FOR EACH ROW BEGIN
  IF NEW.`wrong_note_id` IS NULL OR NEW.`wrong_note_id`='' THEN SET NEW.`wrong_note_id`=UUID(); END IF;
END */;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;

--
-- Dumping events for database 'ai_go'
--

--
-- Dumping routines for database 'ai_go'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-08-27 10:36:23
